wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
#ifndef PLATFORM_REG_H
#define PLATFORM_REG_H
#include <stdint.h>
#include "address_map.h"

/* Auto gen based on BB2Ultra_vendor_reg_20250106_v0.xlsx */

typedef struct
{
    /* 0x0000       0x4000_6000
        15:0    R/W    Wdt_divfactor                       1
        23:16   R/W    Wdt_en_byte                         0
        24      W      Wdt_clear                           1
        28:25   R/W    Cnt_limit                           0
        29      R/W    wdtaon_en                           1
        30      R/W    Wdt_mode                            0
        31      R/W1C  Wdt_to                              0
    */
    union
    {
        __IO uint32_t REGWATCH_DOG_TIMER;
        struct
        {
            __IO uint32_t Wdt_divfactor: 16;
            __IO uint32_t Wdt_en_byte: 8;
            __IO uint32_t Wdt_clear: 1;
            __IO uint32_t Cnt_limit: 4;
            __IO uint32_t wdtaon_en: 1;
            __IO uint32_t Wdt_mode: 1;
            __IO uint32_t Wdt_to: 1;
        } BITS_000;
    } u_000;

    /* 0x0004       0x4000_6004
        0       R/W1C  low_pri_int_rsvd0                   1'h0
        1       R/W1C  low_pri_int_rsvd1                   1'h0
        2       R/W1C  low_pri_int_rsvd2                   1'h0
        3       R/W1C  low_pri_int_rsvd3                   1'h0
        4       R/W1C  low_pri_int_rsvd4                   1'h0
        5       R/W1C  low_pri_int_rsvd5                   1'h0
        6       R/W1C  low_pri_int_rsvd6                   1'h0
        7       R/W1C  low_pri_int_rsvd7                   1'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_STATUS;
        struct
        {
            __IO uint32_t low_pri_int_rsvd0: 1;
            __IO uint32_t low_pri_int_rsvd1: 1;
            __IO uint32_t low_pri_int_rsvd2: 1;
            __IO uint32_t low_pri_int_rsvd3: 1;
            __IO uint32_t low_pri_int_rsvd4: 1;
            __IO uint32_t low_pri_int_rsvd5: 1;
            __IO uint32_t low_pri_int_rsvd6: 1;
            __IO uint32_t low_pri_int_rsvd7: 1;
            __I uint32_t RESERVED_0: 24;
        } BITS_004;
    } u_004;

    /* 0x0008       0x4000_6008
        7:0     R/W    int_mode                            8'hFF
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_MODE;
        struct
        {
            __IO uint32_t int_mode: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_008;
    } u_008;

    /* 0x000C       0x4000_600c
        7:0     R/W    int_en                              8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_EN;
        struct
        {
            __IO uint32_t int_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_00C;
    } u_00C;

    /* 0x0010       0x4000_6010
        0       R      timer_intr1andtimer_intr0           0
        1       R      bluewiz_intr_r                      0
        2       R      RSVD                                0
        3       R      btverdor_reg_intr                   0
        4       R      pro_intr_r                          0
        31:5    R      RSVD                                0
    */
    union
    {
        __IO uint32_t BT_MAC_interrupt;
        struct
        {
            __I uint32_t timer_intr1andtimer_intr0: 1;
            __I uint32_t bluewiz_intr_r: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t btverdor_reg_intr: 1;
            __I uint32_t pro_intr_r: 1;
            __I uint32_t RESERVED_0: 27;
        } BITS_010;
    } u_010;

    /* 0x0014       0x4000_6014
        0       R      otg_intr                            0
        1       R      sdio_host_intr                      0
        15:2    R      RSVD                                0
        16      R      rxi300_intr                         0
        17      R      rdp_intr                            0
        23:18   R      RSVD                                0
        24      RW     rxi300_intr_en                      1
        25      RW     rdp_intr_en                         0
        31:26   R      RSVD                                0
    */
    union
    {
        __IO uint32_t REG_PLATFORM_INT_CTRL;
        struct
        {
            __I uint32_t otg_intr: 1;
            __I uint32_t sdio_host_intr: 1;
            __I uint32_t RESERVED_2: 14;
            __I uint32_t rxi300_intr: 1;
            __I uint32_t rdp_intr: 1;
            __I uint32_t RESERVED_1: 6;
            __IO uint32_t rxi300_intr_en: 1;
            __IO uint32_t rdp_intr_en: 1;
            __I uint32_t RESERVED_0: 6;
        } BITS_014;
    } u_014;

    /* 0x0018       0x4000_6018
        7:0     R/W    int_pol                             8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t Interrupt_edge_option;
        struct
        {
            __IO uint32_t int_pol: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_018;
    } u_018;

    /* 0x001C       0x4000_601c
        11:0    RW     BIT_DEBUG_SEL                       0
        15:12   R      RSVD                                0
        16      RW     pke_clk_always_disable              1'h0
        17      RW     pke_clk_always_enable               1'h0
        18      RW     ppe_clk_always_disable              1'h0
        19      RW     ppe_clk_always_enable               1'h0
        28:20   R      RSVD                                0
        29      RW     spi_speed_up_sim                    0
        30      R      RSVD                                0
        31      RW     uartlog_sir_inv                     0
    */
    union
    {
        __IO uint32_t REG_DEBUG_SEL;
        struct
        {
            __IO uint32_t BIT_DEBUG_SEL: 12;
            __I uint32_t RESERVED_2: 4;
            __IO uint32_t pke_clk_always_disable: 1;
            __IO uint32_t pke_clk_always_enable: 1;
            __IO uint32_t ppe_clk_always_disable: 1;
            __IO uint32_t ppe_clk_always_enable: 1;
            __I uint32_t RESERVED_1: 9;
            __IO uint32_t spi_speed_up_sim: 1;
            __I uint32_t RESERVED_0: 1;
            __IO uint32_t uartlog_sir_inv: 1;
        } BITS_01C;
    } u_01C;

    /* 0x0020       0x4000_6020
        0       R      RSVD                                0
        1       R      RSVD                                0
        2       R      RSVD                                0
        3       R      RSVD                                0
        4       R      RSVD                                0
        5       R      RSVD                                0
        7:6     R      RSVD                                0
        8       R      RSVD                                0
        9       R      RSVD                                0
        15:10   R      RSVD                                0
        16      R      RSVD                                0
        17      R      RSVD                                0
        28:18   R      RSVD                                0
        29      R      RSVD                                0
        30      W1O    reg_efuse_wp                        0
        31      W1O    reg_efuse_rp                        0
    */
    union
    {
        __IO uint32_t REG_DATA_FIFO_SWAP_CTRL;
        struct
        {
            __I uint32_t RESERVED_13: 1;
            __I uint32_t RESERVED_12: 1;
            __I uint32_t RESERVED_11: 1;
            __I uint32_t RESERVED_10: 1;
            __I uint32_t RESERVED_9: 1;
            __I uint32_t RESERVED_8: 1;
            __I uint32_t RESERVED_7: 2;
            __I uint32_t RESERVED_6: 1;
            __I uint32_t RESERVED_5: 1;
            __I uint32_t RESERVED_4: 6;
            __I uint32_t RESERVED_3: 1;
            __I uint32_t RESERVED_2: 1;
            __I uint32_t RESERVED_1: 11;
            __I uint32_t RESERVED_0: 1;
            __IO uint32_t reg_efuse_wp: 1;
            __IO uint32_t reg_efuse_rp: 1;
        } BITS_020;
    } u_020;

    /* 0x0024       0x4000_6024
        5:0     R/W    reg_timer1_9_4_dma_en               0
        7:6     R      RSVD                                0
        8       R      RSVD                                0
        9       R      RSVD                                0
        10      R/W    reg_fwpi_enable                     1
        11      R/W    RSVD                                0
        12      R/W    RSVD                                0
        13      R/W    dmac_clk_always_disable             0
        14      R/W    dmac_clk_always_enable              0
        15      R/W    RSVD                                1
        23:16   R      RSVD                                0
        24      R/W    RSVD                                0
        25      R/W    RSVD                                0
        26      R/W    RSVD                                0
        27      R/W    RSVD                                0
        28      R/W    RSVD                                0
        30:29   R      RSVD                                0
        31      R/W    dsp_dma_int_mask_n                  1
    */
    union
    {
        __IO uint32_t REG_DMAC_CLK_CTRL;
        struct
        {
            __IO uint32_t reg_timer1_9_4_dma_en: 6;
            __I uint32_t RESERVED_12: 2;
            __I uint32_t RESERVED_11: 1;
            __I uint32_t RESERVED_10: 1;
            __IO uint32_t reg_fwpi_enable: 1;
            __IO uint32_t RESERVED_9: 1;
            __IO uint32_t RESERVED_8: 1;
            __IO uint32_t dmac_clk_always_disable: 1;
            __IO uint32_t dmac_clk_always_enable: 1;
            __IO uint32_t RESERVED_7: 1;
            __I uint32_t RESERVED_6: 8;
            __IO uint32_t RESERVED_5: 1;
            __IO uint32_t RESERVED_4: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 2;
            __IO uint32_t dsp_dma_int_mask_n: 1;
        } BITS_024;
    } u_024;

    __IO uint32_t RSVD_0x28[10];

    /* 0x0050       0x4000_6050
        0       R/W    rtc_nmi_int_enable                  0
        31:1    R      RSVD                                0
    */
    union
    {
        __IO uint32_t REG_RTC_PF_NMI_EN;
        struct
        {
            __IO uint32_t rtc_nmi_int_enable: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_050;
    } u_050;

    __IO uint32_t RSVD_0x54[3];

    /* 0x0060       0x4000_6060
        0       R/W    ADP_INT_EN                          1'h0
        1       R/W    ADP_INT_MODE                        1'h1
        2       R/W    ADP_INT_POL                         1'h1
        3       R      ADP_INT                             1'h0
        4       W1C    ADP_INT_CLR                         1'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_ADP_INT;
        struct
        {
            __IO uint32_t ADP_INT_EN: 1;
            __IO uint32_t ADP_INT_MODE: 1;
            __IO uint32_t ADP_INT_POL: 1;
            __I uint32_t ADP_INT: 1;
            __IO uint32_t ADP_INT_CLR: 1;
            __I uint32_t RESERVED_0: 27;
        } BITS_060;
    } u_060;

