wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x0064       0x4000_6064
        0       R/W    VBAT_INT_EN                         1'h0
        1       R/W    VBAT_INT_MODE                       1'h1
        2       R/W    VBAT_INT_POL                        1'h1
        3       R      VBAT_INT                            1'h0
        4       W1C    VBAT_INT_CLR                        1'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_VBAT_INT;
        struct
        {
            __IO uint32_t VBAT_INT_EN: 1;
            __IO uint32_t VBAT_INT_MODE: 1;
            __IO uint32_t VBAT_INT_POL: 1;
            __I uint32_t VBAT_INT: 1;
            __IO uint32_t VBAT_INT_CLR: 1;
            __I uint32_t RESERVED_0: 27;
        } BITS_064;
    } u_064;

    /* 0x0068       0x4000_6068
        0       R/W    MFB_INT_EN                          1'h0
        1       R/W    MFB_INT_MODE                        1'h1
        2       R/W    MFB_INT_POL                         1'h1
        3       R      MFB_INT                             1'h0
        4       W1C    MFB_INT_CLR                         1'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_MFB_INT;
        struct
        {
            __IO uint32_t MFB_INT_EN: 1;
            __IO uint32_t MFB_INT_MODE: 1;
            __IO uint32_t MFB_INT_POL: 1;
            __I uint32_t MFB_INT: 1;
            __IO uint32_t MFB_INT_CLR: 1;
            __I uint32_t RESERVED_0: 27;
        } BITS_068;
    } u_068;

    __IO uint32_t RSVD_0x6c[9];

    /* 0x0090       0x4000_6090
        31:0    R/W    OUT_DATA0                           0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_OUT_DATA0;
        struct
        {
            __IO uint32_t OUT_DATA0: 32;
        } BITS_090;
    } u_090;

    /* 0x0094       0x4000_6094
        31:0    R/W    OUT_DATA1                           0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_OUT_DATA1;
        struct
        {
            __IO uint32_t OUT_DATA1: 32;
        } BITS_094;
    } u_094;

    /* 0x0098       0x4000_6098
        31:0    R      IN_DATA0                            0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_IN_DATA0;
        struct
        {
            __I uint32_t IN_DATA0: 32;
        } BITS_098;
    } u_098;

    /* 0x009C       0x4000_609c
        31:0    R      IN_DATA1                            0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_IN_DATA1;
        struct
        {
            __I uint32_t IN_DATA1: 32;
        } BITS_09C;
    } u_09C;

    /* 0x00A0       0x4000_60a0
        0       R/W1C  outbox_rdy_r                        0
        1       R/W    out_empty_inten                     0
        2       R/W    out_int_mode                        0
        3       R/W1C  out_edge_sts                        0
        4       R      rx_data_crc_ok                      0
        15:5    R      RSVD                                0
        16      R/W1C  inbox_rdy_r                         0
        17      R/W    in_rdy_inten                        0
        30:18   R      RSVD                                0
        31      R/W    pta_i2c_en                          0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_CTRL;
        struct
        {
            __IO uint32_t outbox_rdy_r: 1;
            __IO uint32_t out_empty_inten: 1;
            __IO uint32_t out_int_mode: 1;
            __IO uint32_t out_edge_sts: 1;
            __I uint32_t rx_data_crc_ok: 1;
            __I uint32_t RESERVED_1: 11;
            __IO uint32_t inbox_rdy_r: 1;
            __IO uint32_t in_rdy_inten: 1;
            __I uint32_t RESERVED_0: 13;
            __IO uint32_t pta_i2c_en: 1;
        } BITS_0A0;
    } u_0A0;

    /* 0x00A4       0x4000_60a4
        31:0    R      RSVD                                0
    */
    __IO uint32_t REG_MCU_BT_TIME_STAMP;

    /* 0x00A8       0x4000_60a8
        31:0    R      RSVD                                0
    */
    __IO uint32_t REG_MCU_BT_CLOCK_COMPARE;

    /* 0x00AC       0x4000_60ac
        7:0     R/W    BIT_EFUSE_BURN_GNT                  8'h0
        23:8    R      RSVD                                16'h0
        28:24   R/W    EF_SCAN_END[8:4]                    0
        31:29   R      RSVD                                3'h0
    */
    union
    {
        __IO uint32_t REG_EFUSE_PGPWD;
        struct
        {
            __IO uint32_t BIT_EFUSE_BURN_GNT: 8;
            __I uint32_t RESERVED_1: 16;
            __IO uint32_t EF_SCAN_END_8_4: 5;
            __I uint32_t RESERVED_0: 3;
        } BITS_0AC;
    } u_0AC;

    /* 0x00B0       0x4000_60b0
        7:0     R/W    Data7-0                             8'h0
        16:8    R/W    RegAddr8-0                          9'h0
        17      R      RSVD                                0
        18      R/W    Alden                               0
        19      R      RSVD                                0
        23:20   R/W    setup_time                          4'h6
        26:24   R/W    VDDQ_time                           3'h1
        27      R/W    RD_time                             0
        30:28   R/W    PG_time
                                3'h2
        31      R/W    Flag                                0
    */
    union
    {
        __IO uint32_t REG_EFUSE_CTRL;
        struct
        {
            __IO uint32_t Data7_0: 8;
            __IO uint32_t RegAddr8_0: 9;
            __I uint32_t RESERVED_1: 1;
            __IO uint32_t Alden: 1;
            __I uint32_t RESERVED_0: 1;
            __IO uint32_t setup_time: 4;
            __IO uint32_t VDDQ_time: 3;
            __IO uint32_t RD_time: 1;
            __IO uint32_t PG_time: 3;
            __IO uint32_t Flag: 1;
        } BITS_0B0;
    } u_0B0;

    /* 0x00B4       0x4000_60b4
        6:0     R/WAC  Thres6-0                            7'h0
        7       R/W    EFSCAN_FAIL                         0
        9:8     R/W    EFCELL_SEL                          2'b0
        10      R/W    r_PWC_EV2EF                         0
        11      R/W    EFPGMEN_FORCE                       0
        15:12   R/W    EF_SCAN_EADR                        0
        24:16   R/W    EF_SCAN_SADR                        0
        25      R/W    EFPD_SEL                            0
        26      R/W    EFCRES_SEL                          0
        31:27   R/W    DUMMY                               5'b00011
    */
    union
    {
        __IO uint32_t REG_EFUSE_TEST;
        struct
        {
            __IO uint32_t Thres6_0: 7;
            __IO uint32_t EFSCAN_FAIL: 1;
            __IO uint32_t EFCELL_SEL: 2;
            __IO uint32_t r_PWC_EV2EF: 1;
            __IO uint32_t EFPGMEN_FORCE: 1;
            __IO uint32_t EF_SCAN_EADR: 4;
            __IO uint32_t EF_SCAN_SADR: 9;
            __IO uint32_t EFPD_SEL: 1;
            __IO uint32_t EFCRES_SEL: 1;
            __IO uint32_t RESERVED_0: 5;
        } BITS_0B4;
    } u_0B4;

    /* 0x00B8       0x4000_60b8
        0       R/W    efuse_acc_mode                      1'h0
        31:1    R      RSVD                                31'h0
    */
    union
    {
        __IO uint32_t REG_EFUSE_MODE;
        struct
        {
            __IO uint32_t efuse_acc_mode: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_0B8;
    } u_0B8;

    /* 0x00BC       0x4000_60bc
        31:0    R      efuse_version                       32'h2406170A
    */
    union
    {
        __IO uint32_t REG_EFUSE_VERSION;
        struct
        {
            __I uint32_t efuse_version: 32;
        } BITS_0BC;
    } u_0BC;

    __IO uint32_t RSVD_0xc0[17];

    /* 0x0104       0x4000_6104
        31:0    R      RSVD                                0
    */
    __IO uint32_t REG_0x0104;

    __IO uint32_t RSVD_0x108[16];

    /* 0x0148       0x4000_6148
        3:0     RW     reg_cm55_cfgitcmsz                  4'hB
        7:4     RW     reg_cm55_cfgdtcmsz                  4'h8
        10:8    RW     reg_cm55_cfgpahbsz                  3'h3
        11      RW     reg_cm55_cfgfpu                     1'h1
        13:12   RW     reg_cm33_cfgmve                     2'h2
        14      RW     reg_cm55_mpunsdisable               1'h0
        15      R      RSVD                                1'h0
        16      R      RSVD                                1'h0
        17      R      RSVD                                1'h0
        18      RW     reg_cm55_locknsvtor                 1'h0
        19      R      RSVD                                1'h0
        20      RW     reg_cm55_locknsmpu                  1'h0
        21      R      RSVD                                1'h0
        22      RW     reg_cm55_locktcm                    1'h0
        23      R      RSVD                                1'h0
        24      R      RSVD                                1'h0
        25      RW     reg_cm55_lockpahb                   1'h0
        26      RW     reg_cm55_lockdcaic                  1'h0
        28:27   RW     reg_cm55_inittcmen                  2'h3
        29      RW     reg_cm55_initpahben                 1'h1
        30      RW     reg_cm55_initl1rstdis               1'h0
        31      R      RSVD                                1'h0
    */
    union
    {
        __IO uint32_t REG_CM55_CFG_CTRL;
        struct
        {
            __IO uint32_t reg_cm55_cfgitcmsz: 4;
            __IO uint32_t reg_cm55_cfgdtcmsz: 4;
            __IO uint32_t reg_cm55_cfgpahbsz: 3;
            __IO uint32_t reg_cm55_cfgfpu: 1;
            __IO uint32_t reg_cm33_cfgmve: 2;
            __IO uint32_t reg_cm55_mpunsdisable: 1;
            __I uint32_t RESERVED_7: 1;
            __I uint32_t RESERVED_6: 1;
            __I uint32_t RESERVED_5: 1;
            __IO uint32_t reg_cm55_locknsvtor: 1;
            __I uint32_t RESERVED_4: 1;
            __IO uint32_t reg_cm55_locknsmpu: 1;
            __I uint32_t RESERVED_3: 1;
            __IO uint32_t reg_cm55_locktcm: 1;
            __I uint32_t RESERVED_2: 1;
            __I uint32_t RESERVED_1: 1;
            __IO uint32_t reg_cm55_lockpahb: 1;
            __IO uint32_t reg_cm55_lockdcaic: 1;
            __IO uint32_t reg_cm55_inittcmen: 2;
            __IO uint32_t reg_cm55_initpahben: 1;
            __IO uint32_t reg_cm55_initl1rstdis: 1;
            __I uint32_t RESERVED_0: 1;
        } BITS_148;
    } u_148;

    /* 0x014c       0x4000_614c
        24:0    R      RSVD                                25'h0000000
        31:25   R      RSVD                                7'h0
    */
    union
    {
        __IO uint32_t REG_CM55_INITSVTOR;
        struct
        {
            __I uint32_t RESERVED_1: 25;
            __I uint32_t RESERVED_0: 7;
        } BITS_14c;
    } u_14c;

    /* 0x0150       0x4000_6150
        24:0    R/W    reg_cm55_initnsvtor                 25'h0000000
        31:25   R      RSVD                                7'h0
    */
    union
    {
        __IO uint32_t REG_CM55_INITNSVTOR;
        struct
        {
            __IO uint32_t reg_cm55_initnsvtor: 25;
            __I uint32_t RESERVED_0: 7;
        } BITS_150;
    } u_150;

