wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x0154       0x4000_6154
        7:0     R      reg_cm55_currpri                    8'h0
        16:8    R      reg_cm55_intnum                     9'h0
        17      R      reg_cm55_currns                     1'h1
        18      R      reg_cm55_lockup                     1'h0
        19      R      reg_cm55_txev                       1'h0
        20      R      reg_cm55_halted                     1'h0
        21      R      reg_cm55_dbgrestarted               1'h1
        22      R      reg_cm55_fpixc                      1'h0
        23      R      reg_cm55_fpidc                      1'h0
        24      R      reg_cm55_fpofc                      1'h0
        25      R      reg_cm55_fpufc                      1'h0
        26      R      reg_cm55_fpdzc                      1'h0
        27      R      reg_cm55_fpioc                      1'h0
        31:28   R      RSVD                                4'h0
    */
    union
    {
        __IO uint32_t REG_CM55_STS;
        struct
        {
            __I uint32_t reg_cm55_currpri: 8;
            __I uint32_t reg_cm55_intnum: 9;
            __I uint32_t reg_cm55_currns: 1;
            __I uint32_t reg_cm55_lockup: 1;
            __I uint32_t reg_cm55_txev: 1;
            __I uint32_t reg_cm55_halted: 1;
            __I uint32_t reg_cm55_dbgrestarted: 1;
            __I uint32_t reg_cm55_fpixc: 1;
            __I uint32_t reg_cm55_fpidc: 1;
            __I uint32_t reg_cm55_fpofc: 1;
            __I uint32_t reg_cm55_fpufc: 1;
            __I uint32_t reg_cm55_fpdzc: 1;
            __I uint32_t reg_cm55_fpioc: 1;
            __I uint32_t RESERVED_0: 4;
        } BITS_154;
    } u_154;

    /* 0x0158       0x4000_6158
        30:0    R      reg_cm55_currpc                     31'h7fff_ffff
        31      R      RSVD                                1'h0
    */
    union
    {
        __IO uint32_t REG_CM55_CURRPC;
        struct
        {
            __I uint32_t reg_cm55_currpc: 31;
            __I uint32_t RESERVED_0: 1;
        } BITS_158;
    } u_158;

    /* 0x015c       0x4000_615c
        31:0    R      reg_cm55_faultstat_31_0             32'h0
    */
    union
    {
        __IO uint32_t REG_CM55_FAULTSTAT_31_0;
        struct
        {
            __I uint32_t reg_cm55_faultstat_31_0: 32;
        } BITS_15c;
    } u_15c;

    /* 0x0160       0x4000_6160
        10:0    R      reg_cm55_faultstat_42_32            11'h0
        31:11   R      RSVD                                21'h0
    */
    union
    {
        __IO uint32_t REG_CM55_FAULTSTAT_42_32;
        struct
        {
            __I uint32_t reg_cm55_faultstat_42_32: 11;
            __I uint32_t RESERVED_0: 21;
        } BITS_160;
    } u_160;

    /* 0x0164       0x4000_6164
        31:0    R      reg_cm55_version                    32'hcf04_0001
    */
    union
    {
        __IO uint32_t REG_CM55_VERSION;
        struct
        {
            __I uint32_t reg_cm55_version: 32;
        } BITS_164;
    } u_164;

    /* 0x0168       0x4000_6168
        0       R/W    reg_cm55_cache_dvfs_en              1'h0
        1       R/W    reg_cm55_itcm_rom_vsel_sync_en      1'h1
        2       R/W    reg_cm55_itcm_ram_vsel_sync_en      1'h1
        3       R/W    reg_cm55_dtcm_ram_vsel_sync_en      1'h1
        31:4    R      RSVD                                28'h0
    */
    union
    {
        __IO uint32_t REG_CM55_DVFS_CTRL;
        struct
        {
            __IO uint32_t reg_cm55_cache_dvfs_en: 1;
            __IO uint32_t reg_cm55_itcm_rom_vsel_sync_en: 1;
            __IO uint32_t reg_cm55_itcm_ram_vsel_sync_en: 1;
            __IO uint32_t reg_cm55_dtcm_ram_vsel_sync_en: 1;
            __I uint32_t RESERVED_0: 28;
        } BITS_168;
    } u_168;

    __IO uint32_t RSVD_0x16c[69];

    /* 0x0280       0x4000_6280
        9:0     R/W    EFUSE_WP_START                      10'h1a6
        11:10   R      RSVD                                2'h0
        21:12   R/W    EFUSE_WP_END                        10'h1ff
        29:22   R      RSVD                                8'h0
        30      W1O    EFUSE_WP_LOCK                       1'h0
        31      R/W    EFUSE_WP_EN                         1'h0
    */
    union
    {
        __IO uint32_t efuse_write_protect;
        struct
        {
            __IO uint32_t EFUSE_WP_START: 10;
            __I uint32_t RESERVED_1: 2;
            __IO uint32_t EFUSE_WP_END: 10;
            __I uint32_t RESERVED_0: 8;
            __IO uint32_t EFUSE_WP_LOCK: 1;
            __IO uint32_t EFUSE_WP_EN: 1;
        } BITS_280;
    } u_280;

    /* 0x0284       0x4000_6284
        9:0     R/W    EFUSE_RP_START                      10'h1a6
        11:10   R      RSVD                                2'h0
        21:12   R/W    EFUSE_RP_END                        10'h1ff
        29:22   R      RSVD                                8'h0
        30      W1O    EFUSE_RP_LOCK                       1'h0
        31      R/W    EFUSE_RP_EN                         1'h0
    */
    union
    {
        __IO uint32_t efuse_read_protect;
        struct
        {
            __IO uint32_t EFUSE_RP_START: 10;
            __I uint32_t RESERVED_1: 2;
            __IO uint32_t EFUSE_RP_END: 10;
            __I uint32_t RESERVED_0: 8;
            __IO uint32_t EFUSE_RP_LOCK: 1;
            __IO uint32_t EFUSE_RP_EN: 1;
        } BITS_284;
    } u_284;

    /* 0x0288       0x4000_6288
        0       R/W    data_ram_err_flag_en                1'h0
        1       R/W    data_ram_err_int_en                 1'h0
        2       R/W    data_ram_rd_flag_clr                1'h0
        3       R/W    data_ram_err_int_clr                1'h0
        31:4    R      RSVD                                28'h0
    */
    union
    {
        __IO uint32_t REG_DATA_RAM_ERR_0;
        struct
        {
            __IO uint32_t data_ram_err_flag_en: 1;
            __IO uint32_t data_ram_err_int_en: 1;
            __IO uint32_t data_ram_rd_flag_clr: 1;
            __IO uint32_t data_ram_err_int_clr: 1;
            __I uint32_t RESERVED_0: 28;
        } BITS_288;
    } u_288;

