wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x028C       0x4000_628c
        20:0    R      data_ram_err_flag                   21'h0
        21      R      data_ram_err_int                    1'h0
        31:22   R      RSVD                                10'h0
    */
    union
    {
        __IO uint32_t REG_DATA_RAM_ERR_1;
        struct
        {
            __I uint32_t data_ram_err_flag: 21;
            __I uint32_t data_ram_err_int: 1;
            __I uint32_t RESERVED_0: 10;
        } BITS_28C;
    } u_28C;

    __IO uint32_t RSVD_0x290[28];

    /* 0x0300       0x4000_6300
        0       R/W    SYS_TIMER_RST_SEL                   1'h1
        1       R/W    SYS_TIMER_MANUAL_RSTB               1'h0
        31:2    R      RSVD                                30'h0
    */
    union
    {
        __IO uint32_t REG_SYS_TIMER_CTL;
        struct
        {
            __IO uint32_t SYS_TIMER_RST_SEL: 1;
            __IO uint32_t SYS_TIMER_MANUAL_RSTB: 1;
            __I uint32_t RESERVED_0: 30;
        } BITS_300;
    } u_300;

    /* 0x0304       0x4000_6304
        31:0    R      SYS_TIMER_CNT                       32'h0
    */
    union
    {
        __IO uint32_t REG_SYS_TIMER_CNT;
        struct
        {
            __I uint32_t SYS_TIMER_CNT: 32;
        } BITS_304;
    } u_304;

    /* 0x0308       0x4000_6308
        31:0    R      RSVD                                32'h0
    */
    __IO uint32_t REG_SYS_TIMER_RSVD;

    /* 0x030C       0x4000_630c
        31:0    R      SYS_TIMER_VERSION                   32'h2306270A
    */
    union
    {
        __IO uint32_t REG_SYS_TIMER_VERSION;
        struct
        {
            __I uint32_t SYS_TIMER_VERSION: 32;
        } BITS_30C;
    } u_30C;

    /* 0x310        0x4000_6310
        7:0     R/W    timer1_9_gpio_trig_sel              8'hFF
        23:8    R/W    timer1_9_gpio_trig_deb_cnt_limit    16'h1
        24      R/W    timer1_9_gpio_trig_deb_en           1'h0
        25      R      timer1_9_gpio_trig_deb_sts          1'h0
        31:26   R      RSVD                                6'h0
    */
    union
    {
        __IO uint32_t REG_TIMER1_9_GPIO_TRIG_CTRL;
        struct
        {
            __IO uint32_t timer1_9_gpio_trig_sel: 8;
            __IO uint32_t timer1_9_gpio_trig_deb_cnt_limit: 16;
            __IO uint32_t timer1_9_gpio_trig_deb_en: 1;
            __I uint32_t timer1_9_gpio_trig_deb_sts: 1;
            __I uint32_t RESERVED_0: 6;
        } BITS_310;
    } u_310;

    /* 0x314        0x4000_6314
        7:0     W1C    RO_AON_WK_REASON_VCORE              8'h0
        9:8     W1C    RO_AON_WK_REASON_VAD_VCORE          2'h0
        15:10   R      reserved                            6'b0
        23:16   R      RO_AON_WK_REASON_VCORE_RO           8'h0
        25:24   R      RO_AON_WK_REASON_VAD_VCORE_RO       2'h0
        31:26   R      reserved                            6'b0
    */
    union
    {
        __IO uint32_t REG_AON_WK_REASON_INT;
        struct
        {
            __IO uint32_t RO_AON_WK_REASON_VCORE: 8;
            __IO uint32_t RO_AON_WK_REASON_VAD_VCORE: 2;
            __I uint32_t RESERVED_1: 6;
            __I uint32_t RO_AON_WK_REASON_VCORE_RO: 8;
            __I uint32_t RO_AON_WK_REASON_VAD_VCORE_RO: 2;
            __I uint32_t RESERVED_0: 6;
        } BITS_314;
    } u_314;

    __IO uint32_t RSVD_0x318[122];

    /* 0x500        0x4000_6500
        0       R/W    cm55_rom_bist_rstn                  1'h0
        1       R/W    cm55_rom_bist_mode                  1'h0
        2       R/W    cm55_rom_bist_loop_mode             1'h0
        30:3    R      reserved                            28'h0
        31      R      cm55_rom_bist_done                  1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_0;
        struct
        {
            __IO uint32_t cm55_rom_bist_rstn: 1;
            __IO uint32_t cm55_rom_bist_mode: 1;
            __IO uint32_t cm55_rom_bist_loop_mode: 1;
            __I uint32_t RESERVED_0: 28;
            __I uint32_t cm55_rom_bist_done: 1;
        } BITS_500;
    } u_500;

    /* 0x504        0x4000_6504
        11:0    R/W    cm55_rom_bist_grp_en                12'h0
        31:12   R      reserved                            20'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_1;
        struct
        {
            __IO uint32_t cm55_rom_bist_grp_en: 12;
            __I uint32_t RESERVED_0: 20;
        } BITS_504;
    } u_504;

    /* 0x508        0x4000_6508
        0       R/W    pke_imem_bist_rstn                  1'h0
        1       R/W    pke_imem_bist_mode                  1'h0
        2       R/W    pke_imem_bist_loop_mode             1'h0
        30:3    R      reserved                            28'h0
        31      R      pke_imem_bist_done                  1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_2;
        struct
        {
            __IO uint32_t pke_imem_bist_rstn: 1;
            __IO uint32_t pke_imem_bist_mode: 1;
            __IO uint32_t pke_imem_bist_loop_mode: 1;
            __I uint32_t RESERVED_0: 28;
            __I uint32_t pke_imem_bist_done: 1;
        } BITS_508;
    } u_508;

    /* 0x50c        0x4000_650c
        0       R/W    pke_imem_bist_grp_en                1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_3;
        struct
        {
            __IO uint32_t pke_imem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_50c;
    } u_50c;

    /* 0x510        0x4000_6510
        0       R/W    dsp_rom_bist_rstn                   1'h0
        1       R/W    dsp_rom_bist_mode                   1'h0
        2       R/W    dsp_rom_bist_loop_mode              1'h0
        30:3    R      reserved                            28'h0
        31      R      dsp_rom_bist_done                   1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_4;
        struct
        {
            __IO uint32_t dsp_rom_bist_rstn: 1;
            __IO uint32_t dsp_rom_bist_mode: 1;
            __IO uint32_t dsp_rom_bist_loop_mode: 1;
            __I uint32_t RESERVED_0: 28;
            __I uint32_t dsp_rom_bist_done: 1;
        } BITS_510;
    } u_510;

    /* 0x514        0x4000_6514
        7:0     R/W    dsp_rom_bist_grp_en                 8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_5;
        struct
        {
            __IO uint32_t dsp_rom_bist_grp_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_514;
    } u_514;

    __IO uint32_t RSVD_0x518[10];

    /* 0x540        0x4000_6540
        31:0    R      cm55_rom_misr_dataout_0_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_0;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_0_31_00: 32;
        } BITS_540;
    } u_540;

    /* 0x544        0x4000_6544
        31:0    R      cm55_rom_misr_dataout_0_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_1;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_0_63_32: 32;
        } BITS_544;
    } u_544;

    /* 0x548        0x4000_6548
        31:0    R      cm55_rom_misr_dataout_1_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_2;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_1_31_00: 32;
        } BITS_548;
    } u_548;

    /* 0x54c        0x4000_654c
        31:0    R      cm55_rom_misr_dataout_1_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_3;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_1_63_32: 32;
        } BITS_54c;
    } u_54c;

    /* 0x550        0x4000_6550
        31:0    R      cm55_rom_misr_dataout_2_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_4;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_2_31_00: 32;
        } BITS_550;
    } u_550;

    /* 0x554        0x4000_6554
        31:0    R      cm55_rom_misr_dataout_2_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_5;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_2_63_32: 32;
        } BITS_554;
    } u_554;

    /* 0x558        0x4000_6558
        31:0    R      cm55_rom_misr_dataout_3_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_6;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_3_31_00: 32;
        } BITS_558;
    } u_558;

    /* 0x55c        0x4000_655c
        31:0    R      cm55_rom_misr_dataout_3_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_7;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_3_63_32: 32;
        } BITS_55c;
    } u_55c;

    /* 0x560        0x4000_6560
        31:0    R      cm55_rom_misr_dataout_4_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_8;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_4_31_00: 32;
        } BITS_560;
    } u_560;

    /* 0x564        0x4000_6564
        31:0    R      cm55_rom_misr_dataout_4_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_9;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_4_63_32: 32;
        } BITS_564;
    } u_564;

    /* 0x568        0x4000_6568
        31:0    R      cm55_rom_misr_dataout_5_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_10;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_5_31_00: 32;
        } BITS_568;
    } u_568;

    /* 0x56c        0x4000_656c
        31:0    R      cm55_rom_misr_dataout_5_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_11;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_5_63_32: 32;
        } BITS_56c;
    } u_56c;

    /* 0x570        0x4000_6570
        31:0    R      cm55_rom_misr_dataout_6_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_12;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_6_31_00: 32;
        } BITS_570;
    } u_570;

    /* 0x574        0x4000_6574
        31:0    R      cm55_rom_misr_dataout_6_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_13;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_6_63_32: 32;
        } BITS_574;
    } u_574;

    /* 0x578        0x4000_6578
        31:0    R      cm55_rom_misr_dataout_7_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_14;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_7_31_00: 32;
        } BITS_578;
    } u_578;

    /* 0x57c        0x4000_657c
        31:0    R      cm55_rom_misr_dataout_7_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_15;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_7_63_32: 32;
        } BITS_57c;
    } u_57c;

    /* 0x580        0x4000_6580
        31:0    R      cm55_rom_misr_dataout_8_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_16;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_8_31_00: 32;
        } BITS_580;
    } u_580;

    /* 0x584        0x4000_6584
        31:0    R      cm55_rom_misr_dataout_8_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_17;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_8_63_32: 32;
        } BITS_584;
    } u_584;

    /* 0x588        0x4000_6588
        31:0    R      cm55_rom_misr_dataout_9_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_18;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_9_31_00: 32;
        } BITS_588;
    } u_588;

