wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x58c        0x4000_658c
        31:0    R      cm55_rom_misr_dataout_9_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_19;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_9_63_32: 32;
        } BITS_58c;
    } u_58c;

    /* 0x590        0x4000_6590
        31:0    R      cm55_rom_misr_dataout_10_31_00      32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_20;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_10_31_00: 32;
        } BITS_590;
    } u_590;

    /* 0x594        0x4000_6594
        31:0    R      cm55_rom_misr_dataout_10_63_32      32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_21;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_10_63_32: 32;
        } BITS_594;
    } u_594;

    /* 0x598        0x4000_6598
        31:0    R      cm55_rom_misr_dataout_11_31_00      32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_22;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_11_31_00: 32;
        } BITS_598;
    } u_598;

    /* 0x59c        0x4000_659c
        31:0    R      cm55_rom_misr_dataout_11_63_32      32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_23;
        struct
        {
            __I uint32_t cm55_rom_misr_dataout_11_63_32: 32;
        } BITS_59c;
    } u_59c;

    /* 0x5a0        0x4000_65a0
        31:0    R      pke_imem_misr_dataout_0_31_00       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_24;
        struct
        {
            __I uint32_t pke_imem_misr_dataout_0_31_00: 32;
        } BITS_5a0;
    } u_5a0;

    /* 0x5a4        0x4000_65a4
        31:0    R      pke_imem_misr_dataout_0_63_32       32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_25;
        struct
        {
            __I uint32_t pke_imem_misr_dataout_0_63_32: 32;
        } BITS_5a4;
    } u_5a4;

    /* 0x5a8        0x4000_65a8
        31:0    R      dsp_rom_misr_dataout_0_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_26;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_0_31_00: 32;
        } BITS_5a8;
    } u_5a8;

    /* 0x5ac        0x4000_65ac
        31:0    R      dsp_rom_misr_dataout_0_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_27;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_0_63_32: 32;
        } BITS_5ac;
    } u_5ac;

    /* 0x5b0        0x4000_65b0
        31:0    R      dsp_rom_misr_dataout_1_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_28;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_1_31_00: 32;
        } BITS_5b0;
    } u_5b0;

    /* 0x5b4        0x4000_65b4
        31:0    R      dsp_rom_misr_dataout_1_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_29;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_1_63_32: 32;
        } BITS_5b4;
    } u_5b4;

    /* 0x5b8        0x4000_65b8
        31:0    R      dsp_rom_misr_dataout_2_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_30;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_2_31_00: 32;
        } BITS_5b8;
    } u_5b8;

    /* 0x5bc        0x4000_65bc
        31:0    R      dsp_rom_misr_dataout_2_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_31;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_2_63_32: 32;
        } BITS_5bc;
    } u_5bc;

    /* 0x5c0        0x4000_65c0
        31:0    R      dsp_rom_misr_dataout_3_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_32;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_3_31_00: 32;
        } BITS_5c0;
    } u_5c0;

    /* 0x5c4        0x4000_65c4
        31:0    R      dsp_rom_misr_dataout_3_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_33;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_3_63_32: 32;
        } BITS_5c4;
    } u_5c4;

    /* 0x5c8        0x4000_65c8
        31:0    R      dsp_rom_misr_dataout_4_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_34;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_4_31_00: 32;
        } BITS_5c8;
    } u_5c8;

    /* 0x5cc        0x4000_65cc
        31:0    R      dsp_rom_misr_dataout_4_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_35;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_4_63_32: 32;
        } BITS_5cc;
    } u_5cc;

    /* 0x5d0        0x4000_65d0
        31:0    R      dsp_rom_misr_dataout_5_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_36;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_5_31_00: 32;
        } BITS_5d0;
    } u_5d0;

    /* 0x5d4        0x4000_65d4
        31:0    R      dsp_rom_misr_dataout_5_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_37;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_5_63_32: 32;
        } BITS_5d4;
    } u_5d4;

    /* 0x5d8        0x4000_65d8
        31:0    R      dsp_rom_misr_dataout_6_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_38;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_6_31_00: 32;
        } BITS_5d8;
    } u_5d8;

    /* 0x5dc        0x4000_65dc
        31:0    R      dsp_rom_misr_dataout_6_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_39;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_6_63_32: 32;
        } BITS_5dc;
    } u_5dc;

    /* 0x5e0        0x4000_65e0
        31:0    R      dsp_rom_misr_dataout_7_31_00        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_40;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_7_31_00: 32;
        } BITS_5e0;
    } u_5e0;

