wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x5e4        0x4000_65e4
        31:0    R      dsp_rom_misr_dataout_7_63_32        32'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_ROM_DATA_41;
        struct
        {
            __I uint32_t dsp_rom_misr_dataout_7_63_32: 32;
        } BITS_5e4;
    } u_5e4;

    /* 0x5e8        0x4000_65e8
        31:0    R      reserved                            32'h0
    */
    __IO uint32_t REG_MBIST_ROM_DATA_42;

    /* 0x5ec        0x4000_65ec
        31:0    R      reserved                            32'h0
    */
    __IO uint32_t REG_MBIST_ROM_DATA_43;

    /* 0x5f0        0x4000_65f0
        31:0    R      reserved                            32'h0
    */
    __IO uint32_t REG_MBIST_ROM_DATA_44;

    /* 0x5f4        0x4000_65f4
        31:0    R      reserved                            32'h0
    */
    __IO uint32_t REG_MBIST_ROM_DATA_45;

    __IO uint32_t RSVD_0x5f8[2];

    /* 0x600        0x4000_6600
        0       R/W    cm55_itcm_ram_bist_rstn             1'h0
        1       R/W    cm55_itcm_ram_bist_mode             1'h0
        2       R/W    cm55_itcm_ram_drf_bist_mode         1'h0
        3       R/W    cm55_itcm_ram_drf_test_resume       1'h0
        4       R/W    cm55_itcm_ram_bist_loop_mode        1'h0
        5       R/W    cm55_itcm_ram_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      cm55_itcm_ram_drf_start_pause       1'h0
        30      R      cm55_itcm_ram_drf_bist_done         1'h0
        31      R      cm55_itcm_ram_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_0;
        struct
        {
            __IO uint32_t cm55_itcm_ram_bist_rstn: 1;
            __IO uint32_t cm55_itcm_ram_bist_mode: 1;
            __IO uint32_t cm55_itcm_ram_drf_bist_mode: 1;
            __IO uint32_t cm55_itcm_ram_drf_test_resume: 1;
            __IO uint32_t cm55_itcm_ram_bist_loop_mode: 1;
            __IO uint32_t cm55_itcm_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t cm55_itcm_ram_drf_start_pause: 1;
            __I uint32_t cm55_itcm_ram_drf_bist_done: 1;
            __I uint32_t cm55_itcm_ram_bist_done: 1;
        } BITS_600;
    } u_600;

    /* 0x604        0x4000_6604
        7:0     R/W    cm55_itcm_ram_bist_grp_en           8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_1;
        struct
        {
            __IO uint32_t cm55_itcm_ram_bist_grp_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_604;
    } u_604;

    /* 0x608        0x4000_6608
        7:0     R      cm55_itcm_ram_bist_fail             8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_2;
        struct
        {
            __I uint32_t cm55_itcm_ram_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_608;
    } u_608;

    /* 0x60c        0x4000_660c
        7:0     R      cm55_itcm_ram_drf_bist_fail         8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_3;
        struct
        {
            __I uint32_t cm55_itcm_ram_drf_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_60c;
    } u_60c;

    /* 0x610        0x4000_6610
        0       R/W    cm55_dtcm_ram_bist_rstn             1'h0
        1       R/W    cm55_dtcm_ram_bist_mode             1'h0
        2       R/W    cm55_dtcm_ram_drf_bist_mode         1'h0
        3       R/W    cm55_dtcm_ram_drf_test_resume       1'h0
        4       R/W    cm55_dtcm_ram_bist_loop_mode        1'h0
        5       R/W    cm55_dtcm_ram_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      cm55_dtcm_ram_drf_start_pause       1'h0
        30      R      cm55_dtcm_ram_drf_bist_done         1'h0
        31      R      cm55_dtcm_ram_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_4;
        struct
        {
            __IO uint32_t cm55_dtcm_ram_bist_rstn: 1;
            __IO uint32_t cm55_dtcm_ram_bist_mode: 1;
            __IO uint32_t cm55_dtcm_ram_drf_bist_mode: 1;
            __IO uint32_t cm55_dtcm_ram_drf_test_resume: 1;
            __IO uint32_t cm55_dtcm_ram_bist_loop_mode: 1;
            __IO uint32_t cm55_dtcm_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t cm55_dtcm_ram_drf_start_pause: 1;
            __I uint32_t cm55_dtcm_ram_drf_bist_done: 1;
            __I uint32_t cm55_dtcm_ram_bist_done: 1;
        } BITS_610;
    } u_610;

    /* 0x614        0x4000_6614
        7:0     R/W    cm55_dtcm_ram_bist_grp_en           8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_5;
        struct
        {
            __IO uint32_t cm55_dtcm_ram_bist_grp_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_614;
    } u_614;

    /* 0x618        0x4000_6618
        7:0     R      cm55_dtcm_ram_bist_fail             8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_6;
        struct
        {
            __I uint32_t cm55_dtcm_ram_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_618;
    } u_618;

    /* 0x61c        0x4000_661c
        7:0     R      cm55_dtcm_ram_drf_bist_fail         8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_7;
        struct
        {
            __I uint32_t cm55_dtcm_ram_drf_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_61c;
    } u_61c;

    /* 0x620        0x4000_6620
        0       R/W    cm55_cache_bist_rstn                1'h0
        1       R/W    cm55_cache_bist_mode                1'h0
        2       R/W    cm55_cache_drf_bist_mode            1'h0
        3       R/W    cm55_cache_drf_test_resume          1'h0
        4       R/W    cm55_cache_bist_loop_mode           1'h0
        5       R/W    cm55_cache_dyn_read_en              1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      cm55_cache_drf_start_pause          1'h0
        30      R      cm55_cache_drf_bist_done            1'h0
        31      R      cm55_cache_bist_done                1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_20;
        struct
        {
            __IO uint32_t cm55_cache_bist_rstn: 1;
            __IO uint32_t cm55_cache_bist_mode: 1;
            __IO uint32_t cm55_cache_drf_bist_mode: 1;
            __IO uint32_t cm55_cache_drf_test_resume: 1;
            __IO uint32_t cm55_cache_bist_loop_mode: 1;
            __IO uint32_t cm55_cache_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t cm55_cache_drf_start_pause: 1;
            __I uint32_t cm55_cache_drf_bist_done: 1;
            __I uint32_t cm55_cache_bist_done: 1;
        } BITS_620;
    } u_620;

    /* 0x624        0x4000_6624
        17:0    R/W    cm55_cache_bist_grp_en              18'h0
        31:18   R      reserved                            14'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_21;
        struct
        {
            __IO uint32_t cm55_cache_bist_grp_en: 18;
            __I uint32_t RESERVED_0: 14;
        } BITS_624;
    } u_624;

    /* 0x628        0x4000_6628
        17:0    R      cm55_cache_bist_fail                18'h0
        31:18   R      reserved                            14'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_22;
        struct
        {
            __I uint32_t cm55_cache_bist_fail: 18;
            __I uint32_t RESERVED_0: 14;
        } BITS_628;
    } u_628;

