wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x62c        0x4000_662c
        17:0    R      cm55_cache_drf_bist_fail            18'h0
        31:18   R      reserved                            14'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_23;
        struct
        {
            __I uint32_t cm55_cache_drf_bist_fail: 18;
            __I uint32_t RESERVED_0: 14;
        } BITS_62c;
    } u_62c;

    /* 0x630        0x4000_6630
        0       R      reserved                            1'h0
        1       R      reserved                            1'h0
        2       R      reserved                            1'h0
        3       R      reserved                            1'h0
        4       R      reserved                            1'h0
        5       R      reserved                            1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      reserved                            1'h0
        30      R      reserved                            1'h0
        31      R      reserved                            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_630;
        struct
        {
            __I uint32_t RESERVED_10: 1;
            __I uint32_t RESERVED_9: 1;
            __I uint32_t RESERVED_8: 1;
            __I uint32_t RESERVED_7: 1;
            __I uint32_t RESERVED_6: 1;
            __I uint32_t RESERVED_5: 1;
            __I uint32_t RESERVED_4: 1;
            __I uint32_t RESERVED_3: 22;
            __I uint32_t RESERVED_2: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 1;
        } BITS_630;
    } u_630;

    /* 0x634        0x4000_6634
        8:0     R      reserved                            9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_634;
        struct
        {
            __I uint32_t RESERVED_1: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_634;
    } u_634;

    /* 0x638        0x4000_6638
        8:0     R      reserved                            9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_638;
        struct
        {
            __I uint32_t RESERVED_1: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_638;
    } u_638;

    /* 0x63c        0x4000_663c
        8:0     R      reserved                            9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_63c;
        struct
        {
            __I uint32_t RESERVED_1: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_63c;
    } u_63c;

    /* 0x640        0x4000_6640
        0       R/W    data_sram0_bist_rstn                1'h0
        1       R/W    data_sram0_bist_mode                1'h0
        2       R/W    data_sram0_drf_bist_mode            1'h0
        3       R/W    data_sram0_drf_test_resume          1'h0
        4       R/W    data_sram0_bist_loop_mode           1'h0
        5       R/W    data_sram0_dyn_read_en              1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      data_sram0_drf_start_pause          1'h0
        30      R      data_sram0_drf_bist_done            1'h0
        31      R      data_sram0_bist_done                1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_8;
        struct
        {
            __IO uint32_t data_sram0_bist_rstn: 1;
            __IO uint32_t data_sram0_bist_mode: 1;
            __IO uint32_t data_sram0_drf_bist_mode: 1;
            __IO uint32_t data_sram0_drf_test_resume: 1;
            __IO uint32_t data_sram0_bist_loop_mode: 1;
            __IO uint32_t data_sram0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t data_sram0_drf_start_pause: 1;
            __I uint32_t data_sram0_drf_bist_done: 1;
            __I uint32_t data_sram0_bist_done: 1;
        } BITS_640;
    } u_640;

    /* 0x644        0x4000_6644
        9:0     R/W    data_sram0_bist_grp_en              10'h0
        31:10   R      reserved                            22'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_9;
        struct
        {
            __IO uint32_t data_sram0_bist_grp_en: 10;
            __I uint32_t RESERVED_0: 22;
        } BITS_644;
    } u_644;

    /* 0x648        0x4000_6648
        9:0     R      data_sram0_bist_fail                10'h0
        31:10   R      reserved                            22'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_10;
        struct
        {
            __I uint32_t data_sram0_bist_fail: 10;
            __I uint32_t RESERVED_0: 22;
        } BITS_648;
    } u_648;

    /* 0x64c        0x4000_664c
        9:0     R      data_sram0_drf_bist_fail            10'h0
        31:10   R      reserved                            22'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_11;
        struct
        {
            __I uint32_t data_sram0_drf_bist_fail: 10;
            __I uint32_t RESERVED_0: 22;
        } BITS_64c;
    } u_64c;

    /* 0x650        0x4000_6650
        0       R/W    buffer_ram_bist_rstn                1'h0
        1       R/W    buffer_ram_bist_mode                1'h0
        2       R/W    buffer_ram_drf_bist_mode            1'h0
        3       R/W    buffer_ram_drf_test_resume          1'h0
        4       R/W    buffer_ram_bist_loop_mode           1'h0
        5       R/W    buffer_ram_dyn_read_en              1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      buffer_ram_drf_start_pause          1'h0
        30      R      buffer_ram_drf_bist_done            1'h0
        31      R      buffer_ram_bist_done                1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_12;
        struct
        {
            __IO uint32_t buffer_ram_bist_rstn: 1;
            __IO uint32_t buffer_ram_bist_mode: 1;
            __IO uint32_t buffer_ram_drf_bist_mode: 1;
            __IO uint32_t buffer_ram_drf_test_resume: 1;
            __IO uint32_t buffer_ram_bist_loop_mode: 1;
            __IO uint32_t buffer_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t buffer_ram_drf_start_pause: 1;
            __I uint32_t buffer_ram_drf_bist_done: 1;
            __I uint32_t buffer_ram_bist_done: 1;
        } BITS_650;
    } u_650;

