wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x654        0x4000_6654
        3:0     R/W    buffer_ram_bist_grp_en              4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_13;
        struct
        {
            __IO uint32_t buffer_ram_bist_grp_en: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_654;
    } u_654;

    /* 0x658        0x4000_6658
        3:0     R      buffer_ram_bist_fail                4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_14;
        struct
        {
            __I uint32_t buffer_ram_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_658;
    } u_658;

    /* 0x65c        0x4000_665c
        3:0     R      buffer_ram_drf_bist_fail            4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_15;
        struct
        {
            __I uint32_t buffer_ram_drf_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_65c;
    } u_65c;

    /* 0x660        0x4000_6660
        0       R/W    pke_mmem_bist_rstn                  1'h0
        1       R/W    pke_mmem_bist_mode                  1'h0
        2       R/W    pke_mmem_drf_bist_mode              1'h0
        3       R/W    pke_mmem_drf_test_resume            1'h0
        4       R/W    pke_mmem_bist_loop_mode             1'h0
        5       R/W    pke_mmem_dyn_read_en                1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      pke_mmem_drf_start_pause            1'h0
        30      R      pke_mmem_drf_bist_done              1'h0
        31      R      pke_mmem_bist_done                  1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_24;
        struct
        {
            __IO uint32_t pke_mmem_bist_rstn: 1;
            __IO uint32_t pke_mmem_bist_mode: 1;
            __IO uint32_t pke_mmem_drf_bist_mode: 1;
            __IO uint32_t pke_mmem_drf_test_resume: 1;
            __IO uint32_t pke_mmem_bist_loop_mode: 1;
            __IO uint32_t pke_mmem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t pke_mmem_drf_start_pause: 1;
            __I uint32_t pke_mmem_drf_bist_done: 1;
            __I uint32_t pke_mmem_bist_done: 1;
        } BITS_660;
    } u_660;

    /* 0x664        0x4000_6664
        1:0     R/W    pke_mmem_bist_grp_en                2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_25;
        struct
        {
            __IO uint32_t pke_mmem_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_664;
    } u_664;

    /* 0x668        0x4000_6668
        1:0     R      pke_mmem_bist_fail                  2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_26;
        struct
        {
            __I uint32_t pke_mmem_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_668;
    } u_668;

    /* 0x66c        0x4000_666c
        1:0     R      pke_mmem_drf_bist_fail              2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_27;
        struct
        {
            __I uint32_t pke_mmem_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_66c;
    } u_66c;

    /* 0x670        0x4000_6670
        0       R/W    pke_tmem_bist_rstn                  1'h0
        1       R/W    pke_tmem_bist_mode                  1'h0
        2       R/W    pke_tmem_drf_bist_mode              1'h0
        3       R/W    pke_tmem_drf_test_resume            1'h0
        4       R/W    pke_tmem_bist_loop_mode             1'h0
        5       R/W    pke_tmem_dyn_read_en                1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      pke_tmem_drf_start_pause            1'h0
        30      R      pke_tmem_drf_bist_done              1'h0
        31      R      pke_tmem_bist_done                  1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_28;
        struct
        {
            __IO uint32_t pke_tmem_bist_rstn: 1;
            __IO uint32_t pke_tmem_bist_mode: 1;
            __IO uint32_t pke_tmem_drf_bist_mode: 1;
            __IO uint32_t pke_tmem_drf_test_resume: 1;
            __IO uint32_t pke_tmem_bist_loop_mode: 1;
            __IO uint32_t pke_tmem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t pke_tmem_drf_start_pause: 1;
            __I uint32_t pke_tmem_drf_bist_done: 1;
            __I uint32_t pke_tmem_bist_done: 1;
        } BITS_670;
    } u_670;

    /* 0x674        0x4000_6674
        1:0     R/W    pke_tmem_bist_grp_en                2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_29;
        struct
        {
            __IO uint32_t pke_tmem_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_674;
    } u_674;

    /* 0x678        0x4000_6678
        1:0     R      pke_tmem_bist_fail                  2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_30;
        struct
        {
            __I uint32_t pke_tmem_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_678;
    } u_678;

    /* 0x67c        0x4000_667c
        1:0     R      pke_tmem_drf_bist_fail              2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_31;
        struct
        {
            __I uint32_t pke_tmem_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_67c;
    } u_67c;

    /* 0x680        0x4000_6680
        0       R/W    dsp_ram_0_bist_rstn                 1'h0
        1       R/W    dsp_ram_0_bist_mode                 1'h0
        2       R/W    dsp_ram_0_drf_bist_mode             1'h0
        3       R/W    dsp_ram_0_drf_test_resume           1'h0
        4       R/W    dsp_ram_0_bist_loop_mode            1'h0
        5       R/W    dsp_ram_0_dyn_read_en               1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      dsp_ram_0_drf_start_pause           1'h0
        30      R      dsp_ram_0_drf_bist_done             1'h0
        31      R      dsp_ram_0_bist_done                 1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_32;
        struct
        {
            __IO uint32_t dsp_ram_0_bist_rstn: 1;
            __IO uint32_t dsp_ram_0_bist_mode: 1;
            __IO uint32_t dsp_ram_0_drf_bist_mode: 1;
            __IO uint32_t dsp_ram_0_drf_test_resume: 1;
            __IO uint32_t dsp_ram_0_bist_loop_mode: 1;
            __IO uint32_t dsp_ram_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t dsp_ram_0_drf_start_pause: 1;
            __I uint32_t dsp_ram_0_drf_bist_done: 1;
            __I uint32_t dsp_ram_0_bist_done: 1;
        } BITS_680;
    } u_680;

    /* 0x684        0x4000_6684
        13:0    R/W    dsp_ram_0_bist_grp_en               14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_33;
        struct
        {
            __IO uint32_t dsp_ram_0_bist_grp_en: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_684;
    } u_684;

    /* 0x688        0x4000_6688
        13:0    R      dsp_ram_0_bist_fail                 14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_34;
        struct
        {
            __I uint32_t dsp_ram_0_bist_fail: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_688;
    } u_688;

    /* 0x68c        0x4000_668c
        13:0    R      dsp_ram_0_drf_bist_fail             14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_35;
        struct
        {
            __I uint32_t dsp_ram_0_drf_bist_fail: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_68c;
    } u_68c;

    /* 0x690        0x4000_6690
        0       R/W    dsp_ram_1_bist_rstn                 1'h0
        1       R/W    dsp_ram_1_bist_mode                 1'h0
        2       R/W    dsp_ram_1_drf_bist_mode             1'h0
        3       R/W    dsp_ram_1_drf_test_resume           1'h0
        4       R/W    dsp_ram_1_bist_loop_mode            1'h0
        5       R/W    dsp_ram_1_dyn_read_en               1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      dsp_ram_1_drf_start_pause           1'h0
        30      R      dsp_ram_1_drf_bist_done             1'h0
        31      R      dsp_ram_1_bist_done                 1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_36;
        struct
        {
            __IO uint32_t dsp_ram_1_bist_rstn: 1;
            __IO uint32_t dsp_ram_1_bist_mode: 1;
            __IO uint32_t dsp_ram_1_drf_bist_mode: 1;
            __IO uint32_t dsp_ram_1_drf_test_resume: 1;
            __IO uint32_t dsp_ram_1_bist_loop_mode: 1;
            __IO uint32_t dsp_ram_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t dsp_ram_1_drf_start_pause: 1;
            __I uint32_t dsp_ram_1_drf_bist_done: 1;
            __I uint32_t dsp_ram_1_bist_done: 1;
        } BITS_690;
    } u_690;

    /* 0x694        0x4000_6694
        13:0    R/W    dsp_ram_1_bist_grp_en               14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_37;
        struct
        {
            __IO uint32_t dsp_ram_1_bist_grp_en: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_694;
    } u_694;

    /* 0x698        0x4000_6698
        13:0    R      dsp_ram_1_bist_fail                 14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_38;
        struct
        {
            __I uint32_t dsp_ram_1_bist_fail: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_698;
    } u_698;

    /* 0x69c        0x4000_669c
        13:0    R      dsp_ram_1_drf_bist_fail             14'h0
        31:14   R      reserved                            18'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_39;
        struct
        {
            __I uint32_t dsp_ram_1_drf_bist_fail: 14;
            __I uint32_t RESERVED_0: 18;
        } BITS_69c;
    } u_69c;

    /* 0x6a0        0x4000_66a0
        0       R/W    sdio_ram_0_bist_rstn                1'h0
        1       R/W    sdio_ram_0_bist_mode                1'h0
        2       R/W    sdio_ram_0_drf_bist_mode            1'h0
        3       R/W    sdio_ram_0_drf_test_resume          1'h0
        4       R/W    sdio_ram_0_bist_loop_mode           1'h0
        5       R/W    sdio_ram_0_dyn_read_en              1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      sdio_ram_0_drf_start_pause          1'h0
        30      R      sdio_ram_0_drf_bist_done            1'h0
        31      R      sdio_ram_0_bist_done                1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_40;
        struct
        {
            __IO uint32_t sdio_ram_0_bist_rstn: 1;
            __IO uint32_t sdio_ram_0_bist_mode: 1;
            __IO uint32_t sdio_ram_0_drf_bist_mode: 1;
            __IO uint32_t sdio_ram_0_drf_test_resume: 1;
            __IO uint32_t sdio_ram_0_bist_loop_mode: 1;
            __IO uint32_t sdio_ram_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t sdio_ram_0_drf_start_pause: 1;
            __I uint32_t sdio_ram_0_drf_bist_done: 1;
            __I uint32_t sdio_ram_0_bist_done: 1;
        } BITS_6a0;
    } u_6a0;

    /* 0x6a4        0x4000_66a4
        0       R/W    sdio_ram_0_bist_grp_en              1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_41;
        struct
        {
            __IO uint32_t sdio_ram_0_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6a4;
    } u_6a4;

    /* 0x6a8        0x4000_66a8
        0       R      sdio_ram_0_bist_fail                1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_42;
        struct
        {
            __I uint32_t sdio_ram_0_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6a8;
    } u_6a8;

    /* 0x6ac        0x4000_66ac
        0       R      sdio_ram_0_drf_bist_fail            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_43;
        struct
        {
            __I uint32_t sdio_ram_0_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6ac;
    } u_6ac;

    /* 0x6b0        0x4000_66b0
        0       R/W    can_ram_0_bist_rstn                 1'h0
        1       R/W    can_ram_0_bist_mode                 1'h0
        2       R/W    can_ram_0_drf_bist_mode             1'h0
        3       R/W    can_ram_0_drf_test_resume           1'h0
        4       R/W    can_ram_0_bist_loop_mode            1'h0
        5       R/W    can_ram_0_dyn_read_en               1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      can_ram_0_drf_start_pause           1'h0
        30      R      can_ram_0_drf_bist_done             1'h0
        31      R      can_ram_0_bist_done                 1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_44;
        struct
        {
            __IO uint32_t can_ram_0_bist_rstn: 1;
            __IO uint32_t can_ram_0_bist_mode: 1;
            __IO uint32_t can_ram_0_drf_bist_mode: 1;
            __IO uint32_t can_ram_0_drf_test_resume: 1;
            __IO uint32_t can_ram_0_bist_loop_mode: 1;
            __IO uint32_t can_ram_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t can_ram_0_drf_start_pause: 1;
            __I uint32_t can_ram_0_drf_bist_done: 1;
            __I uint32_t can_ram_0_bist_done: 1;
        } BITS_6b0;
    } u_6b0;

    /* 0x6b4        0x4000_66b4
        0       R/W    can_ram_0_bist_grp_en               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_45;
        struct
        {
            __IO uint32_t can_ram_0_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6b4;
    } u_6b4;

    /* 0x6b8        0x4000_66b8
        0       R      can_ram_0_bist_fail                 1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_46;
        struct
        {
            __I uint32_t can_ram_0_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6b8;
    } u_6b8;

    /* 0x6bc        0x4000_66bc
        0       R      can_ram_0_drf_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_47;
        struct
        {
            __I uint32_t can_ram_0_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6bc;
    } u_6bc;

    /* 0x6c0        0x4000_66c0
        0       R/W    can_ram_1_bist_rstn                 1'h0
        1       R/W    can_ram_1_bist_mode                 1'h0
        2       R/W    can_ram_1_drf_bist_mode             1'h0
        3       R/W    can_ram_1_drf_test_resume           1'h0
        4       R/W    can_ram_1_bist_loop_mode            1'h0
        5       R/W    can_ram_1_dyn_read_en               1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      can_ram_1_drf_start_pause           1'h0
        30      R      can_ram_1_drf_bist_done             1'h0
        31      R      can_ram_1_bist_done                 1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_48;
        struct
        {
            __IO uint32_t can_ram_1_bist_rstn: 1;
            __IO uint32_t can_ram_1_bist_mode: 1;
            __IO uint32_t can_ram_1_drf_bist_mode: 1;
            __IO uint32_t can_ram_1_drf_test_resume: 1;
            __IO uint32_t can_ram_1_bist_loop_mode: 1;
            __IO uint32_t can_ram_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t can_ram_1_drf_start_pause: 1;
            __I uint32_t can_ram_1_drf_bist_done: 1;
            __I uint32_t can_ram_1_bist_done: 1;
        } BITS_6c0;
    } u_6c0;

    /* 0x6c4        0x4000_66c4
        0       R/W    can_ram_1_bist_grp_en               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_49;
        struct
        {
            __IO uint32_t can_ram_1_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6c4;
    } u_6c4;

    /* 0x6c8        0x4000_66c8
        0       R      can_ram_1_bist_fail                 1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_50;
        struct
        {
            __I uint32_t can_ram_1_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6c8;
    } u_6c8;

    /* 0x6cc        0x4000_66cc
        0       R      can_ram_1_drf_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_51;
        struct
        {
            __I uint32_t can_ram_1_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6cc;
    } u_6cc;

    /* 0x6d0        0x4000_66d0
        0       R/W    display_128x32_bist_rstn            1'h0
        1       R/W    display_128x32_bist_mode            1'h0
        2       R/W    display_128x32_drf_bist_mode        1'h0
        3       R/W    display_128x32_drf_test_resume      1'h0
        4       R/W    display_128x32_bist_loop_mode       1'h0
        5       R/W    display_128x32_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      display_128x32_drf_start_pause      1'h0
        30      R      display_128x32_drf_bist_done        1'h0
        31      R      display_128x32_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_52;
        struct
        {
            __IO uint32_t display_128x32_bist_rstn: 1;
            __IO uint32_t display_128x32_bist_mode: 1;
            __IO uint32_t display_128x32_drf_bist_mode: 1;
            __IO uint32_t display_128x32_drf_test_resume: 1;
            __IO uint32_t display_128x32_bist_loop_mode: 1;
            __IO uint32_t display_128x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t display_128x32_drf_start_pause: 1;
            __I uint32_t display_128x32_drf_bist_done: 1;
            __I uint32_t display_128x32_bist_done: 1;
        } BITS_6d0;
    } u_6d0;

    /* 0x6d4        0x4000_66d4
        0       R/W    display_128x32_bist_grp_en          1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_53;
        struct
        {
            __IO uint32_t display_128x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6d4;
    } u_6d4;

    /* 0x6d8        0x4000_66d8
        0       R      display_128x32_bist_fail            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_54;
        struct
        {
            __I uint32_t display_128x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6d8;
    } u_6d8;

    /* 0x6dc        0x4000_66dc
        0       R      display_128x32_drf_bist_fail        1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_55;
        struct
        {
            __I uint32_t display_128x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6dc;
    } u_6dc;

    /* 0x6e0        0x4000_66e0
        0       R/W    display_672x24_bist_rstn            1'h0
        1       R/W    display_672x24_bist_mode            1'h0
        2       R/W    display_672x24_drf_bist_mode        1'h0
        3       R/W    display_672x24_drf_test_resume      1'h0
        4       R/W    display_672x24_bist_loop_mode       1'h0
        5       R/W    display_672x24_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      display_672x24_drf_start_pause      1'h0
        30      R      display_672x24_drf_bist_done        1'h0
        31      R      display_672x24_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_56;
        struct
        {
            __IO uint32_t display_672x24_bist_rstn: 1;
            __IO uint32_t display_672x24_bist_mode: 1;
            __IO uint32_t display_672x24_drf_bist_mode: 1;
            __IO uint32_t display_672x24_drf_test_resume: 1;
            __IO uint32_t display_672x24_bist_loop_mode: 1;
            __IO uint32_t display_672x24_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t display_672x24_drf_start_pause: 1;
            __I uint32_t display_672x24_drf_bist_done: 1;
            __I uint32_t display_672x24_bist_done: 1;
        } BITS_6e0;
    } u_6e0;

    /* 0x6e4        0x4000_66e4
        0       R/W    display_672x24_bist_grp_en          1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_57;
        struct
        {
            __IO uint32_t display_672x24_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6e4;
    } u_6e4;

    /* 0x6e8        0x4000_66e8
        0       R      display_672x24_bist_fail            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_58;
        struct
        {
            __I uint32_t display_672x24_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6e8;
    } u_6e8;

