wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x6ec        0x4000_66ec
        0       R      display_672x24_drf_bist_fail        1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_59;
        struct
        {
            __I uint32_t display_672x24_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6ec;
    } u_6ec;

    /* 0x6f0        0x4000_66f0
        0       R/W    jpeg_tc_mem_bist_rstn               1'h0
        1       R/W    jpeg_tc_mem_bist_mode               1'h0
        2       R/W    jpeg_tc_mem_drf_bist_mode           1'h0
        3       R/W    jpeg_tc_mem_drf_test_resume         1'h0
        4       R/W    jpeg_tc_mem_bist_loop_mode          1'h0
        5       R/W    jpeg_tc_mem_dyn_read_en             1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_tc_mem_drf_start_pause         1'h0
        30      R      jpeg_tc_mem_drf_bist_done           1'h0
        31      R      jpeg_tc_mem_bist_done               1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_60;
        struct
        {
            __IO uint32_t jpeg_tc_mem_bist_rstn: 1;
            __IO uint32_t jpeg_tc_mem_bist_mode: 1;
            __IO uint32_t jpeg_tc_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_tc_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_tc_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_tc_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_tc_mem_drf_start_pause: 1;
            __I uint32_t jpeg_tc_mem_drf_bist_done: 1;
            __I uint32_t jpeg_tc_mem_bist_done: 1;
        } BITS_6f0;
    } u_6f0;

    /* 0x6f4        0x4000_66f4
        0       R/W    jpeg_tc_mem_bist_grp_en             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_61;
        struct
        {
            __IO uint32_t jpeg_tc_mem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6f4;
    } u_6f4;

    /* 0x6f8        0x4000_66f8
        0       R      jpeg_tc_mem_bist_fail               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_62;
        struct
        {
            __I uint32_t jpeg_tc_mem_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6f8;
    } u_6f8;

    /* 0x6fc        0x4000_66fc
        0       R      jpeg_tc_mem_drf_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_63;
        struct
        {
            __I uint32_t jpeg_tc_mem_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_6fc;
    } u_6fc;

    /* 0x700        0x4000_6700
        0       R/W    jpeg_mb_mem_bist_rstn               1'h0
        1       R/W    jpeg_mb_mem_bist_mode               1'h0
        2       R/W    jpeg_mb_mem_drf_bist_mode           1'h0
        3       R/W    jpeg_mb_mem_drf_test_resume         1'h0
        4       R/W    jpeg_mb_mem_bist_loop_mode          1'h0
        5       R/W    jpeg_mb_mem_dyn_read_en             1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_mb_mem_drf_start_pause         1'h0
        30      R      jpeg_mb_mem_drf_bist_done           1'h0
        31      R      jpeg_mb_mem_bist_done               1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_64;
        struct
        {
            __IO uint32_t jpeg_mb_mem_bist_rstn: 1;
            __IO uint32_t jpeg_mb_mem_bist_mode: 1;
            __IO uint32_t jpeg_mb_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_mb_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_mb_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_mb_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_mb_mem_drf_start_pause: 1;
            __I uint32_t jpeg_mb_mem_drf_bist_done: 1;
            __I uint32_t jpeg_mb_mem_bist_done: 1;
        } BITS_700;
    } u_700;

    /* 0x704        0x4000_6704
        0       R/W    jpeg_mb_mem_bist_grp_en             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_65;
        struct
        {
            __IO uint32_t jpeg_mb_mem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_704;
    } u_704;

    /* 0x708        0x4000_6708
        0       R      jpeg_mb_mem_bist_fail               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_66;
        struct
        {
            __I uint32_t jpeg_mb_mem_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_708;
    } u_708;

    /* 0x70c        0x4000_670c
        0       R      jpeg_mb_mem_drf_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_67;
        struct
        {
            __I uint32_t jpeg_mb_mem_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_70c;
    } u_70c;

    /* 0x710        0x4000_6710
        0       R/W    jpeg_pp_mem_bist_rstn               1'h0
        1       R/W    jpeg_pp_mem_bist_mode               1'h0
        2       R/W    jpeg_pp_mem_drf_bist_mode           1'h0
        3       R/W    jpeg_pp_mem_drf_test_resume         1'h0
        4       R/W    jpeg_pp_mem_bist_loop_mode          1'h0
        5       R/W    jpeg_pp_mem_dyn_read_en             1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_pp_mem_drf_start_pause         1'h0
        30      R      jpeg_pp_mem_drf_bist_done           1'h0
        31      R      jpeg_pp_mem_bist_done               1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_68;
        struct
        {
            __IO uint32_t jpeg_pp_mem_bist_rstn: 1;
            __IO uint32_t jpeg_pp_mem_bist_mode: 1;
            __IO uint32_t jpeg_pp_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_pp_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_pp_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_pp_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_pp_mem_drf_start_pause: 1;
            __I uint32_t jpeg_pp_mem_drf_bist_done: 1;
            __I uint32_t jpeg_pp_mem_bist_done: 1;
        } BITS_710;
    } u_710;

