wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x714        0x4000_6714
        0       R/W    jpeg_pp_mem_bist_grp_en             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_69;
        struct
        {
            __IO uint32_t jpeg_pp_mem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_714;
    } u_714;

    /* 0x718        0x4000_6718
        0       R      jpeg_pp_mem_bist_fail               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_70;
        struct
        {
            __I uint32_t jpeg_pp_mem_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_718;
    } u_718;

    /* 0x71c        0x4000_671c
        0       R      jpeg_pp_mem_drf_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_71;
        struct
        {
            __I uint32_t jpeg_pp_mem_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_71c;
    } u_71c;

    /* 0x720        0x4000_6720
        0       R/W    jpeg_huff_mem_bist_rstn             1'h0
        1       R/W    jpeg_huff_mem_bist_mode             1'h0
        2       R/W    jpeg_huff_mem_drf_bist_mode         1'h0
        3       R/W    jpeg_huff_mem_drf_test_resume       1'h0
        4       R/W    jpeg_huff_mem_bist_loop_mode        1'h0
        5       R/W    jpeg_huff_mem_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_huff_mem_drf_start_pause       1'h0
        30      R      jpeg_huff_mem_drf_bist_done         1'h0
        31      R      jpeg_huff_mem_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_72;
        struct
        {
            __IO uint32_t jpeg_huff_mem_bist_rstn: 1;
            __IO uint32_t jpeg_huff_mem_bist_mode: 1;
            __IO uint32_t jpeg_huff_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_huff_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_huff_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_huff_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_huff_mem_drf_start_pause: 1;
            __I uint32_t jpeg_huff_mem_drf_bist_done: 1;
            __I uint32_t jpeg_huff_mem_bist_done: 1;
        } BITS_720;
    } u_720;

    /* 0x724        0x4000_6724
        0       R/W    jpeg_huff_mem_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_73;
        struct
        {
            __IO uint32_t jpeg_huff_mem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_724;
    } u_724;

    /* 0x728        0x4000_6728
        0       R      jpeg_huff_mem_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_74;
        struct
        {
            __I uint32_t jpeg_huff_mem_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_728;
    } u_728;

    /* 0x72c        0x4000_672c
        0       R      jpeg_huff_mem_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_75;
        struct
        {
            __I uint32_t jpeg_huff_mem_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_72c;
    } u_72c;

    /* 0x730        0x4000_6730
        0       R/W    jpeg_qmat_mem_bist_rstn             1'h0
        1       R/W    jpeg_qmat_mem_bist_mode             1'h0
        2       R/W    jpeg_qmat_mem_drf_bist_mode         1'h0
        3       R/W    jpeg_qmat_mem_drf_test_resume       1'h0
        4       R/W    jpeg_qmat_mem_bist_loop_mode        1'h0
        5       R/W    jpeg_qmat_mem_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_qmat_mem_drf_start_pause       1'h0
        30      R      jpeg_qmat_mem_drf_bist_done         1'h0
        31      R      jpeg_qmat_mem_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_76;
        struct
        {
            __IO uint32_t jpeg_qmat_mem_bist_rstn: 1;
            __IO uint32_t jpeg_qmat_mem_bist_mode: 1;
            __IO uint32_t jpeg_qmat_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_qmat_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_qmat_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_qmat_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_qmat_mem_drf_start_pause: 1;
            __I uint32_t jpeg_qmat_mem_drf_bist_done: 1;
            __I uint32_t jpeg_qmat_mem_bist_done: 1;
        } BITS_730;
    } u_730;

    /* 0x734        0x4000_6734
        0       R/W    jpeg_qmat_mem_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_77;
        struct
        {
            __IO uint32_t jpeg_qmat_mem_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_734;
    } u_734;

    /* 0x738        0x4000_6738
        0       R      jpeg_qmat_mem_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_78;
        struct
        {
            __I uint32_t jpeg_qmat_mem_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_738;
    } u_738;

    /* 0x73c        0x4000_673c
        0       R      jpeg_qmat_mem_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_79;
        struct
        {
            __I uint32_t jpeg_qmat_mem_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_73c;
    } u_73c;

