wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x740        0x4000_6740
        0       R/W    jpeg_coef_mem_bist_rstn             1'h0
        1       R/W    jpeg_coef_mem_bist_mode             1'h0
        2       R/W    jpeg_coef_mem_drf_bist_mode         1'h0
        3       R/W    jpeg_coef_mem_drf_test_resume       1'h0
        4       R/W    jpeg_coef_mem_bist_loop_mode        1'h0
        5       R/W    jpeg_coef_mem_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      jpeg_coef_mem_drf_start_pause       1'h0
        30      R      jpeg_coef_mem_drf_bist_done         1'h0
        31      R      jpeg_coef_mem_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_80;
        struct
        {
            __IO uint32_t jpeg_coef_mem_bist_rstn: 1;
            __IO uint32_t jpeg_coef_mem_bist_mode: 1;
            __IO uint32_t jpeg_coef_mem_drf_bist_mode: 1;
            __IO uint32_t jpeg_coef_mem_drf_test_resume: 1;
            __IO uint32_t jpeg_coef_mem_bist_loop_mode: 1;
            __IO uint32_t jpeg_coef_mem_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t jpeg_coef_mem_drf_start_pause: 1;
            __I uint32_t jpeg_coef_mem_drf_bist_done: 1;
            __I uint32_t jpeg_coef_mem_bist_done: 1;
        } BITS_740;
    } u_740;

    /* 0x744        0x4000_6744
        1:0     R/W    jpeg_coef_mem_bist_grp_en           2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_81;
        struct
        {
            __IO uint32_t jpeg_coef_mem_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_744;
    } u_744;

    /* 0x748        0x4000_6748
        1:0     R      jpeg_coef_mem_bist_fail             2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_82;
        struct
        {
            __I uint32_t jpeg_coef_mem_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_748;
    } u_748;

    /* 0x74c        0x4000_674c
        1:0     R      jpeg_coef_mem_drf_bist_fail         2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_83;
        struct
        {
            __I uint32_t jpeg_coef_mem_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_74c;
    } u_74c;

    /* 0x750        0x4000_6750
        0       R/W    bt_mac_1024x16_bist_rstn            1'h0
        1       R/W    bt_mac_1024x16_bist_mode            1'h0
        2       R/W    bt_mac_1024x16_drf_bist_mode        1'h0
        3       R/W    bt_mac_1024x16_drf_test_resume      1'h0
        4       R/W    bt_mac_1024x16_bist_loop_mode       1'h0
        5       R/W    bt_mac_1024x16_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_1024x16_drf_start_pause      1'h0
        30      R      bt_mac_1024x16_drf_bist_done        1'h0
        31      R      bt_mac_1024x16_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_84;
        struct
        {
            __IO uint32_t bt_mac_1024x16_bist_rstn: 1;
            __IO uint32_t bt_mac_1024x16_bist_mode: 1;
            __IO uint32_t bt_mac_1024x16_drf_bist_mode: 1;
            __IO uint32_t bt_mac_1024x16_drf_test_resume: 1;
            __IO uint32_t bt_mac_1024x16_bist_loop_mode: 1;
            __IO uint32_t bt_mac_1024x16_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_1024x16_drf_start_pause: 1;
            __I uint32_t bt_mac_1024x16_drf_bist_done: 1;
            __I uint32_t bt_mac_1024x16_bist_done: 1;
        } BITS_750;
    } u_750;

    /* 0x754        0x4000_6754
        0       R/W    bt_mac_1024x16_bist_grp_en          1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_85;
        struct
        {
            __IO uint32_t bt_mac_1024x16_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_754;
    } u_754;

    /* 0x758        0x4000_6758
        0       R      bt_mac_1024x16_bist_fail            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_86;
        struct
        {
            __I uint32_t bt_mac_1024x16_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_758;
    } u_758;

    /* 0x75c        0x4000_675c
        0       R      bt_mac_1024x16_drf_bist_fail        1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_87;
        struct
        {
            __I uint32_t bt_mac_1024x16_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_75c;
    } u_75c;

    /* 0x760        0x4000_6760
        0       R/W    bt_mac_512x16_0_bist_rstn           1'h0
        1       R/W    bt_mac_512x16_0_bist_mode           1'h0
        2       R/W    bt_mac_512x16_0_drf_bist_mode       1'h0
        3       R/W    bt_mac_512x16_0_drf_test_resume     1'h0
        4       R/W    bt_mac_512x16_0_bist_loop_mode      1'h0
        5       R/W    bt_mac_512x16_0_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_512x16_0_drf_start_pause     1'h0
        30      R      bt_mac_512x16_0_drf_bist_done       1'h0
        31      R      bt_mac_512x16_0_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_88;
        struct
        {
            __IO uint32_t bt_mac_512x16_0_bist_rstn: 1;
            __IO uint32_t bt_mac_512x16_0_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_0_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_0_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_0_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_512x16_0_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_0_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_0_bist_done: 1;
        } BITS_760;
    } u_760;

    /* 0x764        0x4000_6764
        0       R/W    bt_mac_512x16_0_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_89;
        struct
        {
            __IO uint32_t bt_mac_512x16_0_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_764;
    } u_764;

    /* 0x768        0x4000_6768
        0       R      bt_mac_512x16_0_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_90;
        struct
        {
            __I uint32_t bt_mac_512x16_0_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_768;
    } u_768;

