wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x76c        0x4000_676c
        0       R      bt_mac_512x16_0_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_91;
        struct
        {
            __I uint32_t bt_mac_512x16_0_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_76c;
    } u_76c;

    /* 0x770        0x4000_6770
        0       R/W    bt_mac_512x16_1_bist_rstn           1'h0
        1       R/W    bt_mac_512x16_1_bist_mode           1'h0
        2       R/W    bt_mac_512x16_1_drf_bist_mode       1'h0
        3       R/W    bt_mac_512x16_1_drf_test_resume     1'h0
        4       R/W    bt_mac_512x16_1_bist_loop_mode      1'h0
        5       R/W    bt_mac_512x16_1_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_512x16_1_drf_start_pause     1'h0
        30      R      bt_mac_512x16_1_drf_bist_done       1'h0
        31      R      bt_mac_512x16_1_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_92;
        struct
        {
            __IO uint32_t bt_mac_512x16_1_bist_rstn: 1;
            __IO uint32_t bt_mac_512x16_1_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_1_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_1_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_1_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_512x16_1_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_1_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_1_bist_done: 1;
        } BITS_770;
    } u_770;

    /* 0x774        0x4000_6774
        0       R/W    bt_mac_512x16_1_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_93;
        struct
        {
            __IO uint32_t bt_mac_512x16_1_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_774;
    } u_774;

    /* 0x778        0x4000_6778
        0       R      bt_mac_512x16_1_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_94;
        struct
        {
            __I uint32_t bt_mac_512x16_1_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_778;
    } u_778;

    /* 0x77c        0x4000_677c
        0       R      bt_mac_512x16_1_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_95;
        struct
        {
            __I uint32_t bt_mac_512x16_1_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_77c;
    } u_77c;

    /* 0x780        0x4000_6780
        0       R/W    bt_mac_512x16_2_bist_rstn           1'h0
        1       R/W    bt_mac_512x16_2_bist_mode           1'h0
        2       R/W    bt_mac_512x16_2_drf_bist_mode       1'h0
        3       R/W    bt_mac_512x16_2_drf_test_resume     1'h0
        4       R/W    bt_mac_512x16_2_bist_loop_mode      1'h0
        5       R/W    bt_mac_512x16_2_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_512x16_2_drf_start_pause     1'h0
        30      R      bt_mac_512x16_2_drf_bist_done       1'h0
        31      R      bt_mac_512x16_2_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_96;
        struct
        {
            __IO uint32_t bt_mac_512x16_2_bist_rstn: 1;
            __IO uint32_t bt_mac_512x16_2_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_2_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_2_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_2_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_2_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_512x16_2_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_2_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_2_bist_done: 1;
        } BITS_780;
    } u_780;

    /* 0x784        0x4000_6784
        0       R/W    bt_mac_512x16_2_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_97;
        struct
        {
            __IO uint32_t bt_mac_512x16_2_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_784;
    } u_784;

    /* 0x788        0x4000_6788
        0       R      bt_mac_512x16_2_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_98;
        struct
        {
            __I uint32_t bt_mac_512x16_2_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_788;
    } u_788;

    /* 0x78c        0x4000_678c
        0       R      bt_mac_512x16_2_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_99;
        struct
        {
            __I uint32_t bt_mac_512x16_2_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_78c;
    } u_78c;

    /* 0x790        0x4000_6790
        0       R/W    bt_mac_512x16_3_bist_rstn           1'h0
        1       R/W    bt_mac_512x16_3_bist_mode           1'h0
        2       R/W    bt_mac_512x16_3_drf_bist_mode       1'h0
        3       R/W    bt_mac_512x16_3_drf_test_resume     1'h0
        4       R/W    bt_mac_512x16_3_bist_loop_mode      1'h0
        5       R/W    bt_mac_512x16_3_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_512x16_3_drf_start_pause     1'h0
        30      R      bt_mac_512x16_3_drf_bist_done       1'h0
        31      R      bt_mac_512x16_3_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_100;
        struct
        {
            __IO uint32_t bt_mac_512x16_3_bist_rstn: 1;
            __IO uint32_t bt_mac_512x16_3_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_3_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_3_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_3_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_3_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_512x16_3_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_3_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_3_bist_done: 1;
        } BITS_790;
    } u_790;

    /* 0x794        0x4000_6794
        0       R/W    bt_mac_512x16_3_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_101;
        struct
        {
            __IO uint32_t bt_mac_512x16_3_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_794;
    } u_794;

    /* 0x798        0x4000_6798
        0       R      bt_mac_512x16_3_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_102;
        struct
        {
            __I uint32_t bt_mac_512x16_3_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_798;
    } u_798;

    /* 0x79c        0x4000_679c
        0       R      bt_mac_512x16_3_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_103;
        struct
        {
            __I uint32_t bt_mac_512x16_3_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_79c;
    } u_79c;

    /* 0x7a0        0x4000_67a0
        0       R/W    bt_mac_512x16_4_bist_rstn           1'h0
        1       R/W    bt_mac_512x16_4_bist_mode           1'h0
        2       R/W    bt_mac_512x16_4_drf_bist_mode       1'h0
        3       R/W    bt_mac_512x16_4_drf_test_resume     1'h0
        4       R/W    bt_mac_512x16_4_bist_loop_mode      1'h0
        5       R/W    bt_mac_512x16_4_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_512x16_4_drf_start_pause     1'h0
        30      R      bt_mac_512x16_4_drf_bist_done       1'h0
        31      R      bt_mac_512x16_4_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_104;
        struct
        {
            __IO uint32_t bt_mac_512x16_4_bist_rstn: 1;
            __IO uint32_t bt_mac_512x16_4_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_4_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_4_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_4_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_4_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_512x16_4_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_4_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_4_bist_done: 1;
        } BITS_7a0;
    } u_7a0;

    /* 0x7a4        0x4000_67a4
        0       R/W    bt_mac_512x16_4_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_105;
        struct
        {
            __IO uint32_t bt_mac_512x16_4_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7a4;
    } u_7a4;

    /* 0x7a8        0x4000_67a8
        0       R      bt_mac_512x16_4_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_106;
        struct
        {
            __I uint32_t bt_mac_512x16_4_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7a8;
    } u_7a8;

    /* 0x7ac        0x4000_67ac
        0       R      bt_mac_512x16_4_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_107;
        struct
        {
            __I uint32_t bt_mac_512x16_4_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7ac;
    } u_7ac;

    /* 0x7b0        0x4000_67b0
        0       R/W    bt_mac_128x16_bist_rstn             1'h0
        1       R/W    bt_mac_128x16_bist_mode             1'h0
        2       R/W    bt_mac_128x16_drf_bist_mode         1'h0
        3       R/W    bt_mac_128x16_drf_test_resume       1'h0
        4       R/W    bt_mac_128x16_bist_loop_mode        1'h0
        5       R/W    bt_mac_128x16_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_128x16_drf_start_pause       1'h0
        30      R      bt_mac_128x16_drf_bist_done         1'h0
        31      R      bt_mac_128x16_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_108;
        struct
        {
            __IO uint32_t bt_mac_128x16_bist_rstn: 1;
            __IO uint32_t bt_mac_128x16_bist_mode: 1;
            __IO uint32_t bt_mac_128x16_drf_bist_mode: 1;
            __IO uint32_t bt_mac_128x16_drf_test_resume: 1;
            __IO uint32_t bt_mac_128x16_bist_loop_mode: 1;
            __IO uint32_t bt_mac_128x16_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_128x16_drf_start_pause: 1;
            __I uint32_t bt_mac_128x16_drf_bist_done: 1;
            __I uint32_t bt_mac_128x16_bist_done: 1;
        } BITS_7b0;
    } u_7b0;

    /* 0x7b4        0x4000_67b4
        0       R/W    bt_mac_128x16_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_109;
        struct
        {
            __IO uint32_t bt_mac_128x16_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7b4;
    } u_7b4;

    /* 0x7b8        0x4000_67b8
        0       R      bt_mac_128x16_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_110;
        struct
        {
            __I uint32_t bt_mac_128x16_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7b8;
    } u_7b8;

    /* 0x7bc        0x4000_67bc
        0       R      bt_mac_128x16_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_111;
        struct
        {
            __I uint32_t bt_mac_128x16_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7bc;
    } u_7bc;

    /* 0x7c0        0x4000_67c0
        0       R/W    bt_mac_128x32_0_bist_rstn           1'h0
        1       R/W    bt_mac_128x32_0_bist_mode           1'h0
        2       R/W    bt_mac_128x32_0_drf_bist_mode       1'h0
        3       R/W    bt_mac_128x32_0_drf_test_resume     1'h0
        4       R/W    bt_mac_128x32_0_bist_loop_mode      1'h0
        5       R/W    bt_mac_128x32_0_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_128x32_0_drf_start_pause     1'h0
        30      R      bt_mac_128x32_0_drf_bist_done       1'h0
        31      R      bt_mac_128x32_0_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_112;
        struct
        {
            __IO uint32_t bt_mac_128x32_0_bist_rstn: 1;
            __IO uint32_t bt_mac_128x32_0_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_0_drf_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_0_drf_test_resume: 1;
            __IO uint32_t bt_mac_128x32_0_bist_loop_mode: 1;
            __IO uint32_t bt_mac_128x32_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_128x32_0_drf_start_pause: 1;
            __I uint32_t bt_mac_128x32_0_drf_bist_done: 1;
            __I uint32_t bt_mac_128x32_0_bist_done: 1;
        } BITS_7c0;
    } u_7c0;

    /* 0x7c4        0x4000_67c4
        0       R/W    bt_mac_128x32_0_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_113;
        struct
        {
            __IO uint32_t bt_mac_128x32_0_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7c4;
    } u_7c4;

    /* 0x7c8        0x4000_67c8
        0       R      bt_mac_128x32_0_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_114;
        struct
        {
            __I uint32_t bt_mac_128x32_0_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7c8;
    } u_7c8;

    /* 0x7cc        0x4000_67cc
        0       R      bt_mac_128x32_0_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_115;
        struct
        {
            __I uint32_t bt_mac_128x32_0_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7cc;
    } u_7cc;

    /* 0x7d0        0x4000_67d0
        0       R/W    bt_mac_128x32_1_bist_rstn           1'h0
        1       R/W    bt_mac_128x32_1_bist_mode           1'h0
        2       R/W    bt_mac_128x32_1_drf_bist_mode       1'h0
        3       R/W    bt_mac_128x32_1_drf_test_resume     1'h0
        4       R/W    bt_mac_128x32_1_bist_loop_mode      1'h0
        5       R/W    bt_mac_128x32_1_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_128x32_1_drf_start_pause     1'h0
        30      R      bt_mac_128x32_1_drf_bist_done       1'h0
        31      R      bt_mac_128x32_1_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_116;
        struct
        {
            __IO uint32_t bt_mac_128x32_1_bist_rstn: 1;
            __IO uint32_t bt_mac_128x32_1_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_1_drf_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_1_drf_test_resume: 1;
            __IO uint32_t bt_mac_128x32_1_bist_loop_mode: 1;
            __IO uint32_t bt_mac_128x32_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_128x32_1_drf_start_pause: 1;
            __I uint32_t bt_mac_128x32_1_drf_bist_done: 1;
            __I uint32_t bt_mac_128x32_1_bist_done: 1;
        } BITS_7d0;
    } u_7d0;

    /* 0x7d4        0x4000_67d4
        0       R/W    bt_mac_128x32_1_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_117;
        struct
        {
            __IO uint32_t bt_mac_128x32_1_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7d4;
    } u_7d4;

    /* 0x7d8        0x4000_67d8
        0       R      bt_mac_128x32_1_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_118;
        struct
        {
            __I uint32_t bt_mac_128x32_1_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7d8;
    } u_7d8;

    /* 0x7dc        0x4000_67dc
        0       R      bt_mac_128x32_1_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_119;
        struct
        {
            __I uint32_t bt_mac_128x32_1_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7dc;
    } u_7dc;

    /* 0x7e0        0x4000_67e0
        0       R/W    bt_mac_216x32_bist_rstn             1'h0
        1       R/W    bt_mac_216x32_bist_mode             1'h0
        2       R/W    bt_mac_216x32_drf_bist_mode         1'h0
        3       R/W    bt_mac_216x32_drf_test_resume       1'h0
        4       R/W    bt_mac_216x32_bist_loop_mode        1'h0
        5       R/W    bt_mac_216x32_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_216x32_drf_start_pause       1'h0
        30      R      bt_mac_216x32_drf_bist_done         1'h0
        31      R      bt_mac_216x32_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_120;
        struct
        {
            __IO uint32_t bt_mac_216x32_bist_rstn: 1;
            __IO uint32_t bt_mac_216x32_bist_mode: 1;
            __IO uint32_t bt_mac_216x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_216x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_216x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_216x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_216x32_drf_start_pause: 1;
            __I uint32_t bt_mac_216x32_drf_bist_done: 1;
            __I uint32_t bt_mac_216x32_bist_done: 1;
        } BITS_7e0;
    } u_7e0;

    /* 0x7e4        0x4000_67e4
        0       R/W    bt_mac_216x32_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_121;
        struct
        {
            __IO uint32_t bt_mac_216x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7e4;
    } u_7e4;

    /* 0x7e8        0x4000_67e8
        0       R      bt_mac_216x32_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_122;
        struct
        {
            __I uint32_t bt_mac_216x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7e8;
    } u_7e8;

    /* 0x7ec        0x4000_67ec
        0       R      bt_mac_216x32_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_123;
        struct
        {
            __I uint32_t bt_mac_216x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7ec;
    } u_7ec;

    /* 0x7f0        0x4000_67f0
        0       R/W    bt_mac_640x32_bist_rstn             1'h0
        1       R/W    bt_mac_640x32_bist_mode             1'h0
        2       R/W    bt_mac_640x32_drf_bist_mode         1'h0
        3       R/W    bt_mac_640x32_drf_test_resume       1'h0
        4       R/W    bt_mac_640x32_bist_loop_mode        1'h0
        5       R/W    bt_mac_640x32_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_640x32_drf_start_pause       1'h0
        30      R      bt_mac_640x32_drf_bist_done         1'h0
        31      R      bt_mac_640x32_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_124;
        struct
        {
            __IO uint32_t bt_mac_640x32_bist_rstn: 1;
            __IO uint32_t bt_mac_640x32_bist_mode: 1;
            __IO uint32_t bt_mac_640x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_640x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_640x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_640x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_640x32_drf_start_pause: 1;
            __I uint32_t bt_mac_640x32_drf_bist_done: 1;
            __I uint32_t bt_mac_640x32_bist_done: 1;
        } BITS_7f0;
    } u_7f0;

    /* 0x7f4        0x4000_67f4
        0       R/W    bt_mac_640x32_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_125;
        struct
        {
            __IO uint32_t bt_mac_640x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7f4;
    } u_7f4;

    /* 0x7f8        0x4000_67f8
        0       R      bt_mac_640x32_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_126;
        struct
        {
            __I uint32_t bt_mac_640x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7f8;
    } u_7f8;

    /* 0x7fc        0x4000_67fc
        0       R      bt_mac_640x32_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_127;
        struct
        {
            __I uint32_t bt_mac_640x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_7fc;
    } u_7fc;

