wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x800        0x4000_6800
        0       R/W    bt_mac_96x32_bist_rstn              1'h0
        1       R/W    bt_mac_96x32_bist_mode              1'h0
        2       R/W    bt_mac_96x32_drf_bist_mode          1'h0
        3       R/W    bt_mac_96x32_drf_test_resume        1'h0
        4       R/W    bt_mac_96x32_bist_loop_mode         1'h0
        5       R/W    bt_mac_96x32_dyn_read_en            1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_96x32_drf_start_pause        1'h0
        30      R      bt_mac_96x32_drf_bist_done          1'h0
        31      R      bt_mac_96x32_bist_done              1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_128;
        struct
        {
            __IO uint32_t bt_mac_96x32_bist_rstn: 1;
            __IO uint32_t bt_mac_96x32_bist_mode: 1;
            __IO uint32_t bt_mac_96x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_96x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_96x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_96x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_96x32_drf_start_pause: 1;
            __I uint32_t bt_mac_96x32_drf_bist_done: 1;
            __I uint32_t bt_mac_96x32_bist_done: 1;
        } BITS_800;
    } u_800;

    /* 0x804        0x4000_6804
        0       R/W    bt_mac_96x32_bist_grp_en            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_129;
        struct
        {
            __IO uint32_t bt_mac_96x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_804;
    } u_804;

    /* 0x808        0x4000_6808
        0       R      bt_mac_96x32_bist_fail              1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_130;
        struct
        {
            __I uint32_t bt_mac_96x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_808;
    } u_808;

    /* 0x80c        0x4000_680c
        0       R      bt_mac_96x32_drf_bist_fail          1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_131;
        struct
        {
            __I uint32_t bt_mac_96x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_80c;
    } u_80c;

    /* 0x810        0x4000_6810
        0       R/W    bt_mac_144x32_bist_rstn             1'h0
        1       R/W    bt_mac_144x32_bist_mode             1'h0
        2       R/W    bt_mac_144x32_drf_bist_mode         1'h0
        3       R/W    bt_mac_144x32_drf_test_resume       1'h0
        4       R/W    bt_mac_144x32_bist_loop_mode        1'h0
        5       R/W    bt_mac_144x32_dyn_read_en           1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_mac_144x32_drf_start_pause       1'h0
        30      R      bt_mac_144x32_drf_bist_done         1'h0
        31      R      bt_mac_144x32_bist_done             1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_132;
        struct
        {
            __IO uint32_t bt_mac_144x32_bist_rstn: 1;
            __IO uint32_t bt_mac_144x32_bist_mode: 1;
            __IO uint32_t bt_mac_144x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_144x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_144x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_144x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_mac_144x32_drf_start_pause: 1;
            __I uint32_t bt_mac_144x32_drf_bist_done: 1;
            __I uint32_t bt_mac_144x32_bist_done: 1;
        } BITS_810;
    } u_810;

    /* 0x814        0x4000_6814
        0       R/W    bt_mac_144x32_bist_grp_en           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_133;
        struct
        {
            __IO uint32_t bt_mac_144x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_814;
    } u_814;

    /* 0x818        0x4000_6818
        0       R      bt_mac_144x32_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_134;
        struct
        {
            __I uint32_t bt_mac_144x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_818;
    } u_818;

    /* 0x81c        0x4000_681c
        0       R      bt_mac_144x32_drf_bist_fail         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_135;
        struct
        {
            __I uint32_t bt_mac_144x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_81c;
    } u_81c;

    /* 0x820        0x4000_6820
        0       R/W    zb_mac_ram32x32_bist_rstn           1'h0
        1       R/W    zb_mac_ram32x32_bist_mode           1'h0
        2       R/W    zb_mac_ram32x32_drf_bist_mode       1'h0
        3       R/W    zb_mac_ram32x32_drf_test_resume     1'h0
        4       R/W    zb_mac_ram32x32_bist_loop_mode      1'h0
        5       R/W    zb_mac_ram32x32_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      zb_mac_ram32x32_drf_start_pause     1'h0
        30      R      zb_mac_ram32x32_drf_bist_done       1'h0
        31      R      zb_mac_ram32x32_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_136;
        struct
        {
            __IO uint32_t zb_mac_ram32x32_bist_rstn: 1;
            __IO uint32_t zb_mac_ram32x32_bist_mode: 1;
            __IO uint32_t zb_mac_ram32x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_ram32x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_ram32x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_ram32x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t zb_mac_ram32x32_drf_start_pause: 1;
            __I uint32_t zb_mac_ram32x32_drf_bist_done: 1;
            __I uint32_t zb_mac_ram32x32_bist_done: 1;
        } BITS_820;
    } u_820;

    /* 0x824        0x4000_6824
        3:0     R/W    zb_mac_ram32x32_bist_grp_en         4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_137;
        struct
        {
            __IO uint32_t zb_mac_ram32x32_bist_grp_en: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_824;
    } u_824;

    /* 0x828        0x4000_6828
        3:0     R      zb_mac_ram32x32_bist_fail           4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_138;
        struct
        {
            __I uint32_t zb_mac_ram32x32_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_828;
    } u_828;

    /* 0x82c        0x4000_682c
        3:0     R      zb_mac_ram32x32_drf_bist_fail       4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_139;
        struct
        {
            __I uint32_t zb_mac_ram32x32_drf_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_82c;
    } u_82c;

    /* 0x830        0x4000_6830
        0       R/W    zb_mac_ram40x32_bist_rstn           1'h0
        1       R/W    zb_mac_ram40x32_bist_mode           1'h0
        2       R/W    zb_mac_ram40x32_drf_bist_mode       1'h0
        3       R/W    zb_mac_ram40x32_drf_test_resume     1'h0
        4       R/W    zb_mac_ram40x32_bist_loop_mode      1'h0
        5       R/W    zb_mac_ram40x32_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      zb_mac_ram40x32_drf_start_pause     1'h0
        30      R      zb_mac_ram40x32_drf_bist_done       1'h0
        31      R      zb_mac_ram40x32_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_140;
        struct
        {
            __IO uint32_t zb_mac_ram40x32_bist_rstn: 1;
            __IO uint32_t zb_mac_ram40x32_bist_mode: 1;
            __IO uint32_t zb_mac_ram40x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_ram40x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_ram40x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_ram40x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t zb_mac_ram40x32_drf_start_pause: 1;
            __I uint32_t zb_mac_ram40x32_drf_bist_done: 1;
            __I uint32_t zb_mac_ram40x32_bist_done: 1;
        } BITS_830;
    } u_830;

    /* 0x834        0x4000_6834
        1:0     R/W    zb_mac_ram40x32_bist_grp_en         2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_141;
        struct
        {
            __IO uint32_t zb_mac_ram40x32_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_834;
    } u_834;

    /* 0x838        0x4000_6838
        1:0     R      zb_mac_ram40x32_bist_fail           2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_142;
        struct
        {
            __I uint32_t zb_mac_ram40x32_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_838;
    } u_838;

    /* 0x83c        0x4000_683c
        1:0     R      zb_mac_ram40x32_drf_bist_fail       2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_143;
        struct
        {
            __I uint32_t zb_mac_ram40x32_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_83c;
    } u_83c;

    /* 0x840        0x4000_6840
        0       R/W    zb_mac_ram16x32_bist_rstn           1'h0
        1       R/W    zb_mac_ram16x32_bist_mode           1'h0
        2       R/W    zb_mac_ram16x32_drf_bist_mode       1'h0
        3       R/W    zb_mac_ram16x32_drf_test_resume     1'h0
        4       R/W    zb_mac_ram16x32_bist_loop_mode      1'h0
        5       R/W    zb_mac_ram16x32_dyn_read_en         1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      zb_mac_ram16x32_drf_start_pause     1'h0
        30      R      zb_mac_ram16x32_drf_bist_done       1'h0
        31      R      zb_mac_ram16x32_bist_done           1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_144;
        struct
        {
            __IO uint32_t zb_mac_ram16x32_bist_rstn: 1;
            __IO uint32_t zb_mac_ram16x32_bist_mode: 1;
            __IO uint32_t zb_mac_ram16x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_ram16x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_ram16x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_ram16x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t zb_mac_ram16x32_drf_start_pause: 1;
            __I uint32_t zb_mac_ram16x32_drf_bist_done: 1;
            __I uint32_t zb_mac_ram16x32_bist_done: 1;
        } BITS_840;
    } u_840;

    /* 0x844        0x4000_6844
        0       R/W    zb_mac_ram16x32_bist_grp_en         1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_145;
        struct
        {
            __IO uint32_t zb_mac_ram16x32_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_844;
    } u_844;

    /* 0x848        0x4000_6848
        0       R      zb_mac_ram16x32_bist_fail           1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_146;
        struct
        {
            __I uint32_t zb_mac_ram16x32_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_848;
    } u_848;

    /* 0x84c        0x4000_684c
        0       R      zb_mac_ram16x32_drf_bist_fail       1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_147;
        struct
        {
            __I uint32_t zb_mac_ram16x32_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_84c;
    } u_84c;

    /* 0x850        0x4000_6850
        0       R/W    bt_modem_rx_bist_rstn               1'h0
        1       R/W    bt_modem_rx_bist_mode               1'h0
        2       R/W    bt_modem_rx_drf_bist_mode           1'h0
        3       R/W    bt_modem_rx_drf_test_resume         1'h0
        4       R/W    bt_modem_rx_bist_loop_mode          1'h0
        5       R/W    bt_modem_rx_dyn_read_en             1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      bt_modem_rx_drf_start_pause         1'h0
        30      R      bt_modem_rx_drf_bist_done           1'h0
        31      R      bt_modem_rx_bist_done               1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_148;
        struct
        {
            __IO uint32_t bt_modem_rx_bist_rstn: 1;
            __IO uint32_t bt_modem_rx_bist_mode: 1;
            __IO uint32_t bt_modem_rx_drf_bist_mode: 1;
            __IO uint32_t bt_modem_rx_drf_test_resume: 1;
            __IO uint32_t bt_modem_rx_bist_loop_mode: 1;
            __IO uint32_t bt_modem_rx_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t bt_modem_rx_drf_start_pause: 1;
            __I uint32_t bt_modem_rx_drf_bist_done: 1;
            __I uint32_t bt_modem_rx_bist_done: 1;
        } BITS_850;
    } u_850;

    /* 0x854        0x4000_6854
        3:0     R/W    bt_modem_rx_bist_grp_en             4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_149;
        struct
        {
            __IO uint32_t bt_modem_rx_bist_grp_en: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_854;
    } u_854;

    /* 0x858        0x4000_6858
        3:0     R      bt_modem_rx_bist_fail               4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_150;
        struct
        {
            __I uint32_t bt_modem_rx_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_858;
    } u_858;

    /* 0x85c        0x4000_685c
        3:0     R      bt_modem_rx_drf_bist_fail           4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_151;
        struct
        {
            __I uint32_t bt_modem_rx_drf_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_85c;
    } u_85c;

    /* 0x860        0x4000_6860
        0       R/W    gmac_ram512x32_bist_rstn            1'h0
        1       R/W    gmac_ram512x32_bist_mode            1'h0
        2       R/W    gmac_ram512x32_drf_bist_mode        1'h0
        3       R/W    gmac_ram512x32_drf_test_resume      1'h0
        4       R/W    gmac_ram512x32_bist_loop_mode       1'h0
        5       R/W    gmac_ram512x32_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      gmac_ram512x32_drf_start_pause      1'h0
        30      R      gmac_ram512x32_drf_bist_done        1'h0
        31      R      gmac_ram512x32_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_152;
        struct
        {
            __IO uint32_t gmac_ram512x32_bist_rstn: 1;
            __IO uint32_t gmac_ram512x32_bist_mode: 1;
            __IO uint32_t gmac_ram512x32_drf_bist_mode: 1;
            __IO uint32_t gmac_ram512x32_drf_test_resume: 1;
            __IO uint32_t gmac_ram512x32_bist_loop_mode: 1;
            __IO uint32_t gmac_ram512x32_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t gmac_ram512x32_drf_start_pause: 1;
            __I uint32_t gmac_ram512x32_drf_bist_done: 1;
            __I uint32_t gmac_ram512x32_bist_done: 1;
        } BITS_860;
    } u_860;

    /* 0x864        0x4000_6864
        1:0     R/W    gmac_ram512x32_bist_grp_en          2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_153;
        struct
        {
            __IO uint32_t gmac_ram512x32_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_864;
    } u_864;

    /* 0x868        0x4000_6868
        1:0     R      gmac_ram512x32_bist_fail            2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_154;
        struct
        {
            __I uint32_t gmac_ram512x32_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_868;
    } u_868;

    /* 0x86c        0x4000_686c
        1:0     R      gmac_ram512x32_drf_bist_fail        2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_155;
        struct
        {
            __I uint32_t gmac_ram512x32_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_86c;
    } u_86c;

    /* 0x870        0x4000_6870
        0       R/W    usb_ram_bist_rstn                   1'h0
        1       R/W    usb_ram_bist_mode                   1'h0
        2       R/W    usb_ram_drf_bist_mode               1'h0
        3       R/W    usb_ram_drf_test_resume             1'h0
        4       R/W    usb_ram_bist_loop_mode              1'h0
        5       R/W    usb_ram_dyn_read_en                 1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      usb_ram_drf_start_pause             1'h0
        30      R      usb_ram_drf_bist_done               1'h0
        31      R      usb_ram_bist_done                   1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_156;
        struct
        {
            __IO uint32_t usb_ram_bist_rstn: 1;
            __IO uint32_t usb_ram_bist_mode: 1;
            __IO uint32_t usb_ram_drf_bist_mode: 1;
            __IO uint32_t usb_ram_drf_test_resume: 1;
            __IO uint32_t usb_ram_bist_loop_mode: 1;
            __IO uint32_t usb_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t usb_ram_drf_start_pause: 1;
            __I uint32_t usb_ram_drf_bist_done: 1;
            __I uint32_t usb_ram_bist_done: 1;
        } BITS_870;
    } u_870;

    /* 0x874        0x4000_6874
        0       R/W    usb_ram_bist_grp_en                 1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_157;
        struct
        {
            __IO uint32_t usb_ram_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_874;
    } u_874;

    /* 0x878        0x4000_6878
        0       R      usb_ram_bist_fail                   1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_158;
        struct
        {
            __I uint32_t usb_ram_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_878;
    } u_878;

    /* 0x87c        0x4000_687c
        0       R      usb_ram_drf_bist_fail               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_159;
        struct
        {
            __I uint32_t usb_ram_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_87c;
    } u_87c;

