wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x880        0x4000_6880
        0       R/W    ppe_clut_bist_rstn                  1'h0
        1       R/W    ppe_clut_bist_mode                  1'h0
        2       R/W    ppe_clut_drf_bist_mode              1'h0
        3       R/W    ppe_clut_drf_test_resume            1'h0
        4       R/W    ppe_clut_bist_loop_mode             1'h0
        5       R/W    ppe_clut_dyn_read_en                1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      ppe_clut_drf_start_pause            1'h0
        30      R      ppe_clut_drf_bist_done              1'h0
        31      R      ppe_clut_bist_done                  1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_160;
        struct
        {
            __IO uint32_t ppe_clut_bist_rstn: 1;
            __IO uint32_t ppe_clut_bist_mode: 1;
            __IO uint32_t ppe_clut_drf_bist_mode: 1;
            __IO uint32_t ppe_clut_drf_test_resume: 1;
            __IO uint32_t ppe_clut_bist_loop_mode: 1;
            __IO uint32_t ppe_clut_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t ppe_clut_drf_start_pause: 1;
            __I uint32_t ppe_clut_drf_bist_done: 1;
            __I uint32_t ppe_clut_bist_done: 1;
        } BITS_880;
    } u_880;

    /* 0x884        0x4000_6884
        0       R/W    ppe_clut_bist_grp_en                1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_161;
        struct
        {
            __IO uint32_t ppe_clut_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_884;
    } u_884;

    /* 0x888        0x4000_6888
        0       R      ppe_clut_bist_fail                  1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_162;
        struct
        {
            __I uint32_t ppe_clut_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_888;
    } u_888;

    /* 0x88c        0x4000_688c
        0       R      ppe_clut_drf_bist_fail              1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_163;
        struct
        {
            __I uint32_t ppe_clut_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_88c;
    } u_88c;

    /* 0x890        0x4000_6890
        0       R/W    ppe_icache_0_bist_rstn              1'h0
        1       R/W    ppe_icache_0_bist_mode              1'h0
        2       R/W    ppe_icache_0_drf_bist_mode          1'h0
        3       R/W    ppe_icache_0_drf_test_resume        1'h0
        4       R/W    ppe_icache_0_bist_loop_mode         1'h0
        5       R/W    ppe_icache_0_dyn_read_en            1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      ppe_icache_0_drf_start_pause        1'h0
        30      R      ppe_icache_0_drf_bist_done          1'h0
        31      R      ppe_icache_0_bist_done              1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_164;
        struct
        {
            __IO uint32_t ppe_icache_0_bist_rstn: 1;
            __IO uint32_t ppe_icache_0_bist_mode: 1;
            __IO uint32_t ppe_icache_0_drf_bist_mode: 1;
            __IO uint32_t ppe_icache_0_drf_test_resume: 1;
            __IO uint32_t ppe_icache_0_bist_loop_mode: 1;
            __IO uint32_t ppe_icache_0_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t ppe_icache_0_drf_start_pause: 1;
            __I uint32_t ppe_icache_0_drf_bist_done: 1;
            __I uint32_t ppe_icache_0_bist_done: 1;
        } BITS_890;
    } u_890;

    /* 0x894        0x4000_6894
        7:0     R/W    ppe_icache_0_bist_grp_en            8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_165;
        struct
        {
            __IO uint32_t ppe_icache_0_bist_grp_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_894;
    } u_894;

    /* 0x898        0x4000_6898
        7:0     R      ppe_icache_0_bist_fail              8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_166;
        struct
        {
            __I uint32_t ppe_icache_0_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_898;
    } u_898;

    /* 0x89c        0x4000_689c
        7:0     R      ppe_icache_0_drf_bist_fail          8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_167;
        struct
        {
            __I uint32_t ppe_icache_0_drf_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_89c;
    } u_89c;

    /* 0x8a0        0x4000_68a0
        0       R/W    ppe_icache_1_bist_rstn              1'h0
        1       R/W    ppe_icache_1_bist_mode              1'h0
        2       R/W    ppe_icache_1_drf_bist_mode          1'h0
        3       R/W    ppe_icache_1_drf_test_resume        1'h0
        4       R/W    ppe_icache_1_bist_loop_mode         1'h0
        5       R/W    ppe_icache_1_dyn_read_en            1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      ppe_icache_1_drf_start_pause        1'h0
        30      R      ppe_icache_1_drf_bist_done          1'h0
        31      R      ppe_icache_1_bist_done              1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_168;
        struct
        {
            __IO uint32_t ppe_icache_1_bist_rstn: 1;
            __IO uint32_t ppe_icache_1_bist_mode: 1;
            __IO uint32_t ppe_icache_1_drf_bist_mode: 1;
            __IO uint32_t ppe_icache_1_drf_test_resume: 1;
            __IO uint32_t ppe_icache_1_bist_loop_mode: 1;
            __IO uint32_t ppe_icache_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t ppe_icache_1_drf_start_pause: 1;
            __I uint32_t ppe_icache_1_drf_bist_done: 1;
            __I uint32_t ppe_icache_1_bist_done: 1;
        } BITS_8a0;
    } u_8a0;

