wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x8a4        0x4000_68a4
        7:0     R/W    ppe_icache_1_bist_grp_en            8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_169;
        struct
        {
            __IO uint32_t ppe_icache_1_bist_grp_en: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_8a4;
    } u_8a4;

    /* 0x8a8        0x4000_68a8
        7:0     R      ppe_icache_1_bist_fail              8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_170;
        struct
        {
            __I uint32_t ppe_icache_1_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_8a8;
    } u_8a8;

    /* 0x8ac        0x4000_68ac
        7:0     R      ppe_icache_1_drf_bist_fail          8'h0
        31:8    R      reserved                            24'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_172;
        struct
        {
            __I uint32_t ppe_icache_1_drf_bist_fail: 8;
            __I uint32_t RESERVED_0: 24;
        } BITS_8ac;
    } u_8ac;

    /* 0x8b0        0x4000_68b0
        0       R/W    vadbuf_2048x64_bist_rstn            1'h0
        1       R/W    vadbuf_2048x64_bist_mode            1'h0
        2       R/W    vadbuf_2048x64_drf_bist_mode        1'h0
        3       R/W    vadbuf_2048x64_drf_test_resume      1'h0
        4       R/W    vadbuf_2048x64_bist_loop_mode       1'h0
        5       R/W    vadbuf_2048x64_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      vadbuf_2048x64_drf_start_pause      1'h0
        30      R      vadbuf_2048x64_drf_bist_done        1'h0
        31      R      vadbuf_2048x64_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_8b0;
        struct
        {
            __IO uint32_t vadbuf_2048x64_bist_rstn: 1;
            __IO uint32_t vadbuf_2048x64_bist_mode: 1;
            __IO uint32_t vadbuf_2048x64_drf_bist_mode: 1;
            __IO uint32_t vadbuf_2048x64_drf_test_resume: 1;
            __IO uint32_t vadbuf_2048x64_bist_loop_mode: 1;
            __IO uint32_t vadbuf_2048x64_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t vadbuf_2048x64_drf_start_pause: 1;
            __I uint32_t vadbuf_2048x64_drf_bist_done: 1;
            __I uint32_t vadbuf_2048x64_bist_done: 1;
        } BITS_8b0;
    } u_8b0;

    /* 0x8b4        0x4000_68b4
        1:0     R/W    vadbuf_2048x64_bist_grp_en          2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_8b4;
        struct
        {
            __IO uint32_t vadbuf_2048x64_bist_grp_en: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_8b4;
    } u_8b4;

    /* 0x8b8        0x4000_68b8
        1:0     R      vadbuf_2048x64_bist_fail            2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_8b8;
        struct
        {
            __I uint32_t vadbuf_2048x64_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_8b8;
    } u_8b8;

    /* 0x8bc        0x4000_68bc
        1:0     R      vadbuf_2048x64_drf_bist_fail        2'h0
        31:2    R      reserved                            30'h0
    */
    union
    {
        __IO uint32_t REG_MBIST_RAM_8bc;
        struct
        {
            __I uint32_t vadbuf_2048x64_drf_bist_fail: 2;
            __I uint32_t RESERVED_0: 30;
        } BITS_8bc;
    } u_8bc;

    /* 0x8c0        0x4000_68c0
        0       R/W    sdio_ram_1_bist_rstn                1'h0
        1       R/W    sdio_ram_1_bist_mode                1'h0
        2       R/W    sdio_ram_1_drf_bist_mode            1'h0
        3       R/W    sdio_ram_1_drf_test_resume          1'h0
        4       R/W    sdio_ram_1_bist_loop_mode           1'h0
        5       R/W    sdio_ram_1_dyn_read_en              1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      sdio_ram_1_drf_start_pause          1'h0
        30      R      sdio_ram_1_drf_bist_done            1'h0
        31      R      sdio_ram_1_bist_done                1'h0
    */
    union
    {
        __IO uint32_t REG_sdio_ram_1_bist_csr;
        struct
        {
            __IO uint32_t sdio_ram_1_bist_rstn: 1;
            __IO uint32_t sdio_ram_1_bist_mode: 1;
            __IO uint32_t sdio_ram_1_drf_bist_mode: 1;
            __IO uint32_t sdio_ram_1_drf_test_resume: 1;
            __IO uint32_t sdio_ram_1_bist_loop_mode: 1;
            __IO uint32_t sdio_ram_1_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t sdio_ram_1_drf_start_pause: 1;
            __I uint32_t sdio_ram_1_drf_bist_done: 1;
            __I uint32_t sdio_ram_1_bist_done: 1;
        } BITS_8c0;
    } u_8c0;

    /* 0x8c4        0x4000_68c4
        0       R/W    sdio_ram_1_bist_grp_en              1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_sdio_ram_1_bist_grp_en;
        struct
        {
            __IO uint32_t sdio_ram_1_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8c4;
    } u_8c4;

    /* 0x8c8        0x4000_68c8
        0       R      sdio_ram_1_bist_fail                1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_sdio_ram_1_bist_fail;
        struct
        {
            __I uint32_t sdio_ram_1_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8c8;
    } u_8c8;

    /* 0x8cc        0x4000_68cc
        0       R      sdio_ram_1_drf_bist_fail            1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_sdio_ram_1_drf_bist_fail;
        struct
        {
            __I uint32_t sdio_ram_1_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8cc;
    } u_8cc;

