wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x8d0        0x4000_68d0
        0       R/W    can_ram_2_bist_rstn                 1'h0
        1       R/W    can_ram_2_bist_mode                 1'h0
        2       R/W    can_ram_2_drf_bist_mode             1'h0
        3       R/W    can_ram_2_drf_test_resume           1'h0
        4       R/W    can_ram_2_bist_loop_mode            1'h0
        5       R/W    can_ram_2_dyn_read_en               1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      can_ram_2_drf_start_pause           1'h0
        30      R      can_ram_2_drf_bist_done             1'h0
        31      R      can_ram_2_bist_done                 1'h0
    */
    union
    {
        __IO uint32_t REG_can_ram_2_bist_csr;
        struct
        {
            __IO uint32_t can_ram_2_bist_rstn: 1;
            __IO uint32_t can_ram_2_bist_mode: 1;
            __IO uint32_t can_ram_2_drf_bist_mode: 1;
            __IO uint32_t can_ram_2_drf_test_resume: 1;
            __IO uint32_t can_ram_2_bist_loop_mode: 1;
            __IO uint32_t can_ram_2_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t can_ram_2_drf_start_pause: 1;
            __I uint32_t can_ram_2_drf_bist_done: 1;
            __I uint32_t can_ram_2_bist_done: 1;
        } BITS_8d0;
    } u_8d0;

    /* 0x8d4        0x4000_68d4
        0       R/W    can_ram_2_bist_grp_en               1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_can_ram_2_bist_grp_en;
        struct
        {
            __IO uint32_t can_ram_2_bist_grp_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8d4;
    } u_8d4;

    /* 0x8d8        0x4000_68d8
        0       R      can_ram_2_bist_fail                 1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_can_ram_2_bist_fail;
        struct
        {
            __I uint32_t can_ram_2_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8d8;
    } u_8d8;

    /* 0x8dc        0x4000_68dc
        0       R      can_ram_2_drf_bist_fail             1'h0
        31:1    R      reserved                            31'h0
    */
    union
    {
        __IO uint32_t REG_can_ram_2_drf_bist_fail;
        struct
        {
            __I uint32_t can_ram_2_drf_bist_fail: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_8dc;
    } u_8dc;

    /* 0x8e0        0x4000_68e0
        0       R/W    dsp_icache_ram_bist_rstn            1'h0
        1       R/W    dsp_icache_ram_bist_mode            1'h0
        2       R/W    dsp_icache_ram_drf_bist_mode        1'h0
        3       R/W    dsp_icache_ram_drf_test_resume      1'h0
        4       R/W    dsp_icache_ram_bist_loop_mode       1'h0
        5       R/W    dsp_icache_ram_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      dsp_icache_ram_drf_start_pause      1'h0
        30      R      dsp_icache_ram_drf_bist_done        1'h0
        31      R      dsp_icache_ram_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_dsp_icache_ram_bist_csr;
        struct
        {
            __IO uint32_t dsp_icache_ram_bist_rstn: 1;
            __IO uint32_t dsp_icache_ram_bist_mode: 1;
            __IO uint32_t dsp_icache_ram_drf_bist_mode: 1;
            __IO uint32_t dsp_icache_ram_drf_test_resume: 1;
            __IO uint32_t dsp_icache_ram_bist_loop_mode: 1;
            __IO uint32_t dsp_icache_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t dsp_icache_ram_drf_start_pause: 1;
            __I uint32_t dsp_icache_ram_drf_bist_done: 1;
            __I uint32_t dsp_icache_ram_bist_done: 1;
        } BITS_8e0;
    } u_8e0;

    /* 0x8e4        0x4000_68e4
        3:0     R/W    dsp_icache_ram_bist_grp_en          4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_dsp_icache_ram_bist_grp_en;
        struct
        {
            __IO uint32_t dsp_icache_ram_bist_grp_en: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_8e4;
    } u_8e4;

    /* 0x8e8        0x4000_68e8
        3:0     R      dsp_icache_ram_bist_fail            4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_dsp_icache_ram_bist_fail;
        struct
        {
            __I uint32_t dsp_icache_ram_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_8e8;
    } u_8e8;

    /* 0x8ec        0x4000_68ec
        3:0     R      dsp_icache_ram_drf_bist_fail        4'h0
        31:4    R      reserved                            28'h0
    */
    union
    {
        __IO uint32_t REG_dsp_icache_ram_drf_bist_fail;
        struct
        {
            __I uint32_t dsp_icache_ram_drf_bist_fail: 4;
            __I uint32_t RESERVED_0: 28;
        } BITS_8ec;
    } u_8ec;

    /* 0x8f0        0x4000_68f0
        0       R/W    dsp_dcache_ram_bist_rstn            1'h0
        1       R/W    dsp_dcache_ram_bist_mode            1'h0
        2       R/W    dsp_dcache_ram_drf_bist_mode        1'h0
        3       R/W    dsp_dcache_ram_drf_test_resume      1'h0
        4       R/W    dsp_dcache_ram_bist_loop_mode       1'h0
        5       R/W    dsp_dcache_ram_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      dsp_dcache_ram_drf_start_pause      1'h0
        30      R      dsp_dcache_ram_drf_bist_done        1'h0
        31      R      dsp_dcache_ram_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_dsp_dcache_ram_bist_csr;
        struct
        {
            __IO uint32_t dsp_dcache_ram_bist_rstn: 1;
            __IO uint32_t dsp_dcache_ram_bist_mode: 1;
            __IO uint32_t dsp_dcache_ram_drf_bist_mode: 1;
            __IO uint32_t dsp_dcache_ram_drf_test_resume: 1;
            __IO uint32_t dsp_dcache_ram_bist_loop_mode: 1;
            __IO uint32_t dsp_dcache_ram_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t dsp_dcache_ram_drf_start_pause: 1;
            __I uint32_t dsp_dcache_ram_drf_bist_done: 1;
            __I uint32_t dsp_dcache_ram_bist_done: 1;
        } BITS_8f0;
    } u_8f0;

    /* 0x8f4        0x4000_68f4
        8:0     R/W    dsp_dcache_ram_bist_grp_en          9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_dsp_dcache_ram_bist_grp_en;
        struct
        {
            __IO uint32_t dsp_dcache_ram_bist_grp_en: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_8f4;
    } u_8f4;

    /* 0x8f8        0x4000_68f8
        8:0     R      dsp_dcache_ram_bist_fail            9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_dsp_dcache_ram_bist_fail;
        struct
        {
            __I uint32_t dsp_dcache_ram_bist_fail: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_8f8;
    } u_8f8;

