wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/platform/platform_reg.h
    /* 0x8fc        0x4000_68fc
        8:0     R      dsp_dcache_ram_drf_bist_fail        9'h0
        31:9    R      reserved                            23'h0
    */
    union
    {
        __IO uint32_t REG_dsp_dcache_ram_drf_bist_fail;
        struct
        {
            __I uint32_t dsp_dcache_ram_drf_bist_fail: 9;
            __I uint32_t RESERVED_0: 23;
        } BITS_8fc;
    } u_8fc;

    /* 0x900        0x4000_6900
        0       R/W    btphy_lr_ramx5_bist_rstn            1'h0
        1       R/W    btphy_lr_ramx5_bist_mode            1'h0
        2       R/W    btphy_lr_ramx5_drf_bist_mode        1'h0
        3       R/W    btphy_lr_ramx5_drf_test_resume      1'h0
        4       R/W    btphy_lr_ramx5_bist_loop_mode       1'h0
        5       R/W    btphy_lr_ramx5_dyn_read_en          1'h0
        6       R      reserved                            1'h0
        28:7    R      reserved                            22'h0
        29      R      btphy_lr_ramx5_drf_start_pause      1'h0
        30      R      btphy_lr_ramx5_drf_bist_done        1'h0
        31      R      btphy_lr_ramx5_bist_done            1'h0
    */
    union
    {
        __IO uint32_t REG_btphy_lr_ramx5_bist_csr;
        struct
        {
            __IO uint32_t btphy_lr_ramx5_bist_rstn: 1;
            __IO uint32_t btphy_lr_ramx5_bist_mode: 1;
            __IO uint32_t btphy_lr_ramx5_drf_bist_mode: 1;
            __IO uint32_t btphy_lr_ramx5_drf_test_resume: 1;
            __IO uint32_t btphy_lr_ramx5_bist_loop_mode: 1;
            __IO uint32_t btphy_lr_ramx5_dyn_read_en: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t RESERVED_0: 22;
            __I uint32_t btphy_lr_ramx5_drf_start_pause: 1;
            __I uint32_t btphy_lr_ramx5_drf_bist_done: 1;
            __I uint32_t btphy_lr_ramx5_bist_done: 1;
        } BITS_900;
    } u_900;

    /* 0x904        0x4000_6904
        4:0     R/W    btphy_lr_ramx5_bist_grp_en          5'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_btphy_lr_ramx5_bist_grp_en;
        struct
        {
            __IO uint32_t btphy_lr_ramx5_bist_grp_en: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_904;
    } u_904;

    /* 0x908        0x4000_6908
        4:0     R      btphy_lr_ramx5_bist_fail            5'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_btphy_lr_ramx5_bist_fail;
        struct
        {
            __I uint32_t btphy_lr_ramx5_bist_fail: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_908;
    } u_908;

    /* 0x90c        0x4000_690c
        4:0     R      btphy_lr_ramx5_drf_bist_fail        5'h0
        31:5    R      reserved                            27'h0
    */
    union
    {
        __IO uint32_t REG_btphy_lr_ramx5_drf_bist_fail;
        struct
        {
            __I uint32_t btphy_lr_ramx5_drf_bist_fail: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_90c;
    } u_90c;

} SoC_VENDOR_REG_TypeDef;

#define VENDOR_REG_BASE                 SOC_VENDOR_REG_BASE
#define SoC_VENDOR                      ((SoC_VENDOR_REG_TypeDef   *) VENDOR_REG_BASE)

#endif //#define PLATFORM_REG_H